{
  "ticker": "SO",
  "posts": [
    {
      "post_id": "1ivkuuk",
      "title": "Am I cooked?",
      "selftext": "\nI need this money to pay our mortgage in the next couple years because our buy down is expiring, which means our interest rate is going up. The account with PLTR down $1,400 is a joint account with my wife and I'm an anxious mess this weekend and hoping she doesn't randomly check. I tried to apply for a loan yesterday to sneak some some money in there so she doesn't see that the balance dipped, but I got denied.\n\nPLTR will recover next week, yeah? My heart is beating like a drum and I can't stop worrying 😓 I've had anxious sad boy weekends, but this one is the worst. I'm scared for Monday.\n",
      "score": 272,
      "upvote_ratio": 0.87,
      "created_utc": 1740237204.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iv6zxy",
      "title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "selftext": "",
      "score": 4151,
      "upvote_ratio": 0.96,
      "created_utc": 1740187221.0,
      "mention_location": "title"
    },
    {
      "post_id": "1iv4q30",
      "title": "DD Droneshield: tendies are printing and WSB is not even joining the party?!",
      "selftext": "Hello Regards,\n\nDroneshield (DRO) is showing promising returns and WSB seems unaware. A quick search on google trends would make it seem that the USA are not aware of the stock at the moment. So here is a small DD to get this beauty of a company on your radar and not leave all the tendies to the Germans and Australians. \n\n  \nPlain and simple:\n\nDRO develops and sells anti-drone tech. DRO engineers, produces and maintains their own products. \n\nCostumers: EU countries that are ramping up their drone defense systems since Ukraine has demonstrated the dangers of drones. Countries neighboring China since they also can't keep their drones to themselves. South American countries that are trying to counter the use of drones by the drug cartels.\n\nAdded value: Their products protect and save lives.\n\n[Their revenue is ramping up with repeat orders by satisfied customers.](https://preview.redd.it/zp0bc0imhkke1.png?width=1058&format=png&auto=webp&s=bc4cd9e2d400ab64f4fdeee2bcf84c4b8293e514)\n\n.\n\n[They manage to maintain super healthy gross profit margins.](https://preview.redd.it/oy2dheyyhkke1.png?width=1068&format=png&auto=webp&s=dfcdc462de4e6c547a8c3325948efb6256ba61bd)\n\n.\n\n[Net profit margin transitioned into the green. ](https://preview.redd.it/hrvdph1qikke1.png?width=1057&format=png&auto=webp&s=596bfe90e67ba299511afd52132c499501c31797)\n\nWhy is the net profit margin relatively low: 200 of their 255 employees are engineers that R&D this company to perfection. My guess is that this is quite expensive. Droneshield understands: great value comes from great products. And great products bring in great costumers.\n\n  \nHere is a page out of their latest earnings report. This update caused the reverse of the trend. It shows that their revenue spike was not a one off event but only the beginning of the profitable era. Read the full report here: [https://static1.squarespace.com/static/660a32624c94dd36e509baf3/t/67995f878b0b2b6c9b290038/1738104717089/4C\\_4Q24.pdf](https://static1.squarespace.com/static/660a32624c94dd36e509baf3/t/67995f878b0b2b6c9b290038/1738104717089/4C_4Q24.pdf)\n\nhttps://preview.redd.it/7ow29x92okke1.png?width=633&format=png&auto=webp&s=26bcc8aedaa65b0100d586dfea9b91a4bdcb543b\n\nNegative: DRO takes on very little debt, to little. Instead they have gradually over the years sold more shares. I would say this should slow down now cash is coming in through sales. \n\n  \nFurthermore they maintain a very healthy balance sheet with 220 million cash balance. Check out their website. Its a piece of art on its own: [https://www.droneshield.com/investor-relations](https://www.droneshield.com/investor-relations)\n\n  \nMy humble position:\n\nhttps://preview.redd.it/ikyzvcrqfkke1.png?width=1534&format=png&auto=webp&s=565d7e0a27412ff805ca54df26f64635d2263423\n\nI plan to stay in for the long run. But if it moons again like last time I will take profit and step back in when the dust settled. \n\nThere is a lot more to be said about this company. But I leave that for the discussion. I hope I have been of service to my fellow regards at WSB.\n\nDisclaimer: I am not a financial advisor. No AI was used making this DD. The first 3 graphs are not fully up to date with the latest earnings report.",
      "score": 13,
      "upvote_ratio": 0.71,
      "created_utc": 1740179716.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iv3i8r",
      "title": "Last play NVDA Yolo",
      "selftext": "Lost $10k today on 0dte NVDA calls. Had a chance to get out but missed my sell order by literally .01 and it cratered down. Averaged down all I had. Honestly not as bad as my other blow ups in the past where I lost 30k twice. But anyways, this is my last play. If I lose, I’ll take my scraps and just voo and recoup my losses in 25 years or so.",
      "score": 57,
      "upvote_ratio": 0.9,
      "created_utc": 1740176524.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iv1ju0",
      "title": "AMD turned me into a gambling addict",
      "selftext": "This is my entire life savings (including IRA) that I have saved up for the past 5 years. I bet my entire portfolio on AMD on the day of the earning and failed miserably. So far, I think I have around $40k in losses just from AMD (both realized and unrealized). In the hopes of recovering my losses I have been getting even more aggressive with my bets. \n\nToday I even asked my parents for money and have added $4k (+1k in margin) in stocks and $6k in options. In retrospect, I really should not have played the earnings. \n\nBut I am confident that AMD will recover in Q2-3.\n\n\n\n\n\n\n\n",
      "score": 176,
      "upvote_ratio": 0.92,
      "created_utc": 1740171595.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iv07j8",
      "title": "Is this wsb enough for you?",
      "selftext": "Apparently shares are is not wsb, so how about 0dte soy puts?",
      "score": 65,
      "upvote_ratio": 0.89,
      "created_utc": 1740168212.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iuykwm",
      "title": "the sector you've never touched IS a 10-bagger, but not like that [DD w/ $250k invested)",
      "selftext": "A few days ago, I saw the[ \\[DD\\]](https://www.reddit.com/r/wallstreetbets/comments/1ir0k5o/this_sector_youve_never_touched_is_a_10bagger_dd/) posted here about the mining industry. The OP of this post was right to point out that the mining sector is due for a massive run and I appreciated the attention they drew to the qualities of a high return opportunity.  However, their recommendation was mostly to invest in mining related to GOLD! Reading that was like watching one set the dining table beautifully, only to proceed to mistake the appetizer for the main dish.\n\nToday I’m going to provide further evidence for the case that the mining industry presents a massive opportunity on a timescale anywhere from right now to the end of Trump’s term. The investments that are going to make you rich, however, have nothing to do with gold, per se, and everything to do with titanium, lithium, rare earth minerals, and the complete market dominance China has over their processing and extraction.\n\n**Part I: Ukraine, Greenland, Russia, Cosmetic Moguls, and the Allied Supply Chain**\n\nWhy does Trump care so much about Greenland? Why is he so insistent on Ukraine signing away 50% of their claim to Ukraine’s minerals and, if that matters so much, why did he cut Ukraine out from the opening negotiations with Russia?\n\nThe answer is that it's all about the supply chain of minerals and metals. China is bending us over the table with their grip over the chain (80-90%+ dominance), especially in separation/processing of the materials. Recently, they [have gone as far as to ban key processing/separation materials needed](https://www.reuters.com/technology/chinese-lithium-company-halts-tech-exports-trade-tensions-build-2025-02-18/), posturing to protect their interests in the face of American policy strides to distance themselves from their grip over the market. They have also kept costs of lithium and other precious earth and minerals artificially low, stymieing western incentive to establish their own supply chain.\n\n[China has been *SO* effective at doing all of this,](https://www.wsj.com/finance/commodities-futures/china-dominant-mineral-mining-global-supply-chain-e2b7840e) that until the last few years, there was **ZERO** mining/processing of rare earth happening domestically in the USA. The picture wasn’t much better for other crucial metals and resources, such as lithium and titanium. We slept too long, took them for granted, and now here we are.\n\nDon’t understand the stakes? [Here is **Marco Rubio**](https://uscriticalmaterials.com/wp-content/uploads/2025/01/Marco-Rubio-video.mp4), our present secretary of state and who has recently opened up peace negotiations with Russia over Ukraine, being an absolute doomer about the state of play with the supply chain. **Lindsey Graham -** another key Trump ally - also has eyes on the issue, especially as it pertains to Ukraine and what they may offer us for security (check out these tweets [here ](https://x.com/LindseyGrahamSC/status/1891046931323040187)and [here](https://x.com/LindseyGrahamSC/status/1799832487285465244)).\n\nLet me be clear that this is a bipartisan issue and it is *extremely* difficult to deny the threat this poses to our national security and economic prosperity (the previous administration came to the same conclusion). That is why it has been a priority of both administrations. However, this present iteration of the Trump administration is uniquely situated to set the market ablaze in ways that previous administrations could not.\n\n**Part II. Convergence, Timing, Trump Administration, Private Equity, Executive Action**\n\nAlright, so we have established that the US is seriously threatened by China’s stranglehold over this sector. What is this administration doing and who are the relevant people involved? I don’t have time to give you all of the reasons that point me in favor of a bullish sentiment on titanium, lithium, and rare earth minerals. Here are a few that I take to be really supportive, however.\n\nFirst, let me introduce you to **Ronald S. Lauder**, heir to the Estée Lauder cosmetics company. For whatever reason, this guy has a real penchant for minerals and mining. He is [*close friends* with Donald Trump](https://www.nytimes.com/2025/02/12/world/europe/trump-ukraine-rare-earth-minerals.html) and is, according to the NY times, the one that initially led Trump to turn his attention to Greenland. He is also very interested in Ukrainian minerals and metals.\n\nYou see, Ronald Lauder is a business partner of **Brian Menell**, CEO of private investment/equity firm [**Techmet**](https://www.techmet.com/), which seeks to expand production of precious minerals across our global assets to help ensure a secure and sustainable supply of the key metals for western-aligned interests.\n\nIf there is one company to look at and one company alone, it is Techmet. Recently, they have secured 180 million from **QIA**. They are **DOE and DFC** contractors with extremely lucrative deals over the last few years. Furthermore, what makes them unusual is that the DFC decided against their usual financing terms and actually went ahead and bought a direct stake in Techmet itself. That means the **US Federal Government** is a stakeholder directly aligned with the interests and priorities of Techmet. \n\nAs if this was not enough, Techmet also has the investment/backing of energy behemoth Mercuria. They also hold advisory members and business partners from big name mining companies like Rio Tinto. Furthermore, their current chairman is **Admiral Mike Mullen** who was previously Chairman of the Joint Chiefs of Staff of the United States, as well as on the board of **General Motors. S**uffice to say that their present reach and influence over western government is compelling as anything I have ever seen before. \n\nIf you are curious, here is the CEO Brian Menell two or so weeks ago discussing the present state of the administration and supply chain issues [here.](https://www.youtube.com/watch?v=sP9_PY5gEug&ab_channel=SmarterMarkets%E2%84%A2) He is bullish about this administration and highlights what needs to happen in order to compete with China effectively. \n\nWhat does he stress? **Permitting, Bureaucracy Reform, Federal Incentivization.** He calls on the administration to lift regulations, give permits quickly, purchase directly and invest in western-aligned companies that are working on the energy transition. Trump is doing *exactly* this, from establishing the sovereign wealth fund, to the guidance issued by way of two executive actions “[Unleashing American Energy”](https://www.whitehouse.gov/presidential-actions/2025/01/unleashing-american-energy/), as well as  [“Unleashing Prosperity through Deregulation](https://www.whitehouse.gov/presidential-actions/2025/01/unleashing-prosperity-through-deregulation/).”\n\nI recommend you read the language, especially Section 9 of the executive order on energy. The order seeks to “establish our position as the leading producer and processor of non-fuel minerals, including rare earth minerals, which will create jobs and prosperity at home, strengthen supply chains for the United States and its allies, and reduce the global influence of malign and adversarial states” as well as “to protect the United States' economic and national security and military preparedness by ensuring that an abundant supply of reliable energy is readily accessible in every State and territory of the Nation”\n\nBy way of the executive orders, federal agencies are instructed (within 60 days) to identify and eliminate barriers to efficient private investment and reduce project timelines for critical energy. Trump also instructs that priority should be placed on making sure USA funds critical mineral ventures and he also instructs to make sure the USA has an adequate stockpile of critical minerals/metals (and to purchase more if not). Emphasis is also placed on geologic mapping, and key western partnerships that share national  security interests, called the **“Quad.”** If you are interested in further reading on this last point, I recommend[ this article ](https://www.orfonline.org/research/the-case-for-a-quad-mineral-security-partnership#_edn81)on Quadrilateral Mineral Partnerships.\n\nHere is another item in the order on Unleashing American Energy:\n\n>(j) Within 60 days of the date of this order, the Secretary of State, Secretary of Commerce, Secretary of Labor, the United States Trade Representative, and the heads of any other relevant agencies, shall submit a report to the Assistant to the President for Economic Policy that includes policy recommendations to enhance the competitiveness of American mining and refining companies in other mineral-wealthy nations.\n\nTrump is not a patient man. He will act quickly after receiving this report in March and he is already trying his best to wrap up Ukraine as quickly as possible too with assurances of mineral access. That's why I believe the shortest timeline to return is now to the end of Trump's term.\n\nFurthermore, I believe that Trump's team began negotiations without Ukraine precisely because they are seeking to get the best minerals deal possible. Russian advances on Ukraine have meant that many of the precious minerals the west is interested in now falls within Russian-occupied territory in Ukraine. Having 50% of the rights to Ukraine's rare earth is not all that great, given this reality**. There is no guarantee that Ukraine will win the war (or when), nor is there a guarantee they will ever regain the territory.** Meanwhile, the US would presumably continue to pump money into Ukraine with no end in sight? Trump isn't going to be OK with that. I think he is working out a post-war deal with Russia that makes certain that minerals will be available immediately.\n\n**Part III: Positions**\n\nWhere to invest? Well, Techmet is private. However, there are still plays that can be made in this sector. Right now I have \\~$250,000 in derivatives and stock opened yesterday and today. Here is where I am at the moment, though I will absolutely re-balance as I continue to do research.\n\nhttps://preview.redd.it/oclseac8cjke1.jpg?width=665&format=pjpg&auto=webp&s=48232bf2a19ed448757da6cc248dee2453ae6faa\n\nhttps://preview.redd.it/nznu3bc8cjke1.jpg?width=690&format=pjpg&auto=webp&s=22a30e2408d70fb47c95264a4a8137c11402d7d1\n\nhttps://preview.redd.it/am8i3ac8cjke1.jpg?width=671&format=pjpg&auto=webp&s=2ca74d99bd71812608bbe3a7bcbe1c4779e5c156\n\nWhy did I pick these? (don't mind Humana or Uber)\n\n>**MP materials** is presently the only rare earth mine and processor in the United States.\n\n>**LYS** is AU but part of \"The Quad\" that Trump opens the door for investments towards when he writes \"(k) The Secretary of State shall consider opportunities to advance the mining and processing of minerals within the United States through the Quadrilateral Security Dialogue.\"\n\n>**REEMF** is self-explanatory, rare earth exploration\n\n>**CAT**  is at a 6 month low. I thought that this was a good time to get in given ramping of mining in future. They have ties to Ukraine's post-war rebuilding via the U.S.-Ukraine Business Council (USUBC).\n\n>**TSLA** (not pictured; getting calls Monday) as Elon Musk is close with Trump and shares concern over lithium in particular. TSLA has [just launched operations in a lithium processing plant in TX as well](https://cen.acs.org/energy/energy-storage-/Tesla-begins-making-lithium-chemicals/102/web/2024/12#:~:text=Credit:%20Tesla,lithium%20production%20in%20the%20US) and I would not be surprised to see substantial federal funding in the short term and medium term. See [also this article.](https://www.nasdaq.com/articles/where-does-tesla-get-its-lithium)\n\n>**UUUU** is largely uranium although they are branching out. I'm bullish on it because of this language: \"(c)  The Secretary of the Interior shall instruct the Director of the U.S. Geological Survey to consider updating the Survey’s list of critical minerals, including for the potential of including uranium.\"\n\n>**IPX** up-and-coming titanium processing w/ a special patent.\n\n>**Other ideas:** Talon Metals (nickel, partnered with TSLA);  ABAT, Holtec, anything having to do with Brazilian Nickel or General Atomics; anything related to the Quad countries and rare earth / metals. I would welcome other suggestions regarding investments that get the right kind of exposure.\n\nI'll close with this. Brian Menell, after meeting Mr. Zelensky in NY alongside other energy executives in September, had this to say in a statement:\n\n>“TechMet, together with our partners, is available to move forward with further work if the U.S. and Ukrainian governments instruct us to do so\"\n\nWestern interests will be ready at a moments notice. Will you be?",
      "score": 490,
      "upvote_ratio": 0.92,
      "created_utc": 1740164147.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iuxgtn",
      "title": "Jensen Falldom For Next Week Earning",
      "selftext": "TLDR: I suck in trading, reverse me and buy Nvidia calls for free money.\n\nOkay okay, I have just got a -98% decrease in my XP puts, but hey I just asked my wife's boyfriend for a little bit more money and some Wendy's payout. Let's start how this NVIDIA will fall.\n\nCurrent situation:\n\n* Jensen's kingdom got kicked out of 140 club, and back to 139 (at the time I write this shit DD), P/E 55.14 (compared to 55.96 for Industrial average) and will have another earning call next week. \n* President Trump are planning to tax 25% tariff on chips outside of US, a bubble for Nvidia manufacturing\n* Yes yes I know 5000 series releases got sold out in seconds, but it was released on Jan 30, so it's next quarter so it doesn't do shit this quarter yet.\n\nWhy you should buy put?\n\n* Insider trading shows that there is a massive sell off, obviously it doesn't say anything much.\n\n[Insider Trading](https://preview.redd.it/t4w62gqc2jke1.png?width=1038&format=png&auto=webp&s=ad922a3c0eb97ce48039d912bb1cc677eeff5db9)\n\n* Nvidia tends to sensitive to news, especially world new and fluctuated the most when it comes to news.\n* Nvidia main manufacturing is TSMC, which got unlove for our beloved President Trump (https://www.mk.co.kr/en/business/11243062)\n* China (in general) wants to compete with chip manufacturing especially with Taiwan (https://www.taipeitimes.com/News/biz/archives/2025/02/11/2003831653)\n* Recently, Google and Microsoft starts to develop their own chips for their AI, so we are heading to era of independent chip-dependent from Nvidia\n* Sure sure, \"yOu sTill nEEd to bUy nVidIa Chips\".From previous earnings, there is a 17% increase in Data Center revenue Q4 2024, a 16% increase in Data Center revenue Q3 2024, and 23% increase in Data Center revenue Q2 2024, and 27% increase in Q1 2024. There is a slow down increase and with a nearest quantum chips release from IQVN, Google, Microsoft, I anticipate that this quarter can still have an increase but not impressive\n* So why I think Nvidia chips are stagnant? The investment of research from their previous earnings clearly shows that they don't want to heavily invest in research as much as before --> Chips independent era gonna be coming.\n\nWhy you should buy calls?\n\n* Because I buy puts\n\nPosition:\n\n[Position](https://preview.redd.it/5yp493fq8jke1.png?width=1372&format=png&auto=webp&s=042b36e8d27ba302fbd34fa70c73ee90ef1e3462)\n\nI buy on August because there are around 150k investment in the same investment and hey I am regarded.   \n  \nI eat crayon to make this dd so NFA but hey I'm gey bear.   \n  \n",
      "score": 0,
      "upvote_ratio": 0.42,
      "created_utc": 1740161428.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iuhlv3",
      "title": "BKSY BlackSky, the Most Interesting Space Stock You Haven't Heard Of",
      "selftext": "BlackSky owns a constellation of satellites that produce near real-time high-resolution imagery. Yesterday they successfully put the first of Gen-3 satellites into orbit with the help of Rocket Lab.\n\n[https://www.rocketlabusa.com/updates/rocket-lab-successfully-launches-60th-electron-first-of-multiple-missions-for-blacksky/](https://www.rocketlabusa.com/updates/rocket-lab-successfully-launches-60th-electron-first-of-multiple-missions-for-blacksky/)\n\nThe Gen-3 boasts an impressive step up vs Gen-2. Including:\n\n\\- 30 min delivery  \n\\- 35 cm resolution  \n\\- performant in low light\n\nhttps://preview.redd.it/zv45212lteke1.png?width=1256&format=png&auto=webp&s=72c588781a689debbdda90cade1d25f740b7298a\n\nWhat impresses me about the company is that have an absolutely ridiculous cadence of contracts announcements. We are talking new contracts week after week after week.\n\nhttps://preview.redd.it/srlxn6g8weke1.png?width=626&format=png&auto=webp&s=396635b4408c866ab77a3571771e993c9db90b14\n\nThis has resulted produced a smooth as butter compounding machine that has recently inflected to positive ebidtda.\n\nhttps://preview.redd.it/49f0wdblweke1.png?width=580&format=png&auto=webp&s=6bba22e008adc454b1a6bc6f9731ede73b71897b\n\nAs far as valuation goes, it stacks of pretty damn nice. For example, far better grow and lower ev / sales multiple compared to it's closest peer PL.\n\nhttps://preview.redd.it/o0wzghh2xeke1.png?width=424&format=png&auto=webp&s=aa27eef224ebe52a3ac67bfde8c6bf4e03384765\n\nBack in the day they had a strategic partnership with PLTR. Not notably sure if it is still ongoing: \n\n[https://www.blacksky.com/blacksky-secures-investment-from-palantir-and-enters-into-multi-year-strategic-partnership-following-successful-pilot-project/](https://www.blacksky.com/blacksky-secures-investment-from-palantir-and-enters-into-multi-year-strategic-partnership-following-successful-pilot-project/)\n\n  \nIn sum, I think BKSY occupies a really interesting niche (high res, low latency imagery) that will likely be able to command really nice margins over time. And they have the benefit of a good liquidity and positive growth, so probably don't need to worry about being hammered by financing - as is the typical case with satellite companies - all that much.\n\nI am rolling with a good slug of commons, and some calls for extra juice.\n\nhttps://preview.redd.it/llssghcjxeke1.png?width=660&format=png&auto=webp&s=62ab5baedaff593425123cb81df6e6a7e161311b\n\nhttps://preview.redd.it/sgxu3qrmxeke1.png?width=339&format=png&auto=webp&s=75a23bf587474d8ab210950f7d804fb998764bee\n\n",
      "score": 151,
      "upvote_ratio": 0.84,
      "created_utc": 1740109349.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iub8fm",
      "title": "All IN CELH M23",
      "selftext": "LOLLL you guys called me a a degen a few days ago, SO OBVIOUS, I see everyone slurping these drinks everywhere. This drink about to replace coffee for young people.\n\nIn college rn and bout to have the largest party\n\nNah but seriously what should I do with all this money",
      "score": 200,
      "upvote_ratio": 0.91,
      "created_utc": 1740090233.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iu8z2i",
      "title": "5000 shares in INTC",
      "selftext": "Nana will be so proud",
      "score": 164,
      "upvote_ratio": 0.92,
      "created_utc": 1740084574.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iu412h",
      "title": "Got an extra salary in 7 minutes (Thank you $PLTR)",
      "selftext": "I needed to compensate yesterday/today losses on INTC so during lunch break I rolled the dice on $PLTR, should have pulled 2 minutes early for a $22k gain, but still decent I just got a extra salary in 7 minutes.\n\nhttps://preview.redd.it/jwqq6vvjwbke1.png?width=2758&format=png&auto=webp&s=86e6b79f16beb2eed1515af044bac986ef3cb5b0\n\nhttps://preview.redd.it/qigca2fqwbke1.png?width=2552&format=png&auto=webp&s=22aa528908bb14f7df6e231fd55926b5837088b3\n\n",
      "score": 2335,
      "upvote_ratio": 0.89,
      "created_utc": 1740072539.0,
      "mention_location": "selftext"
    }
  ],
  "comments": [
    {
      "comment_id": "me7n2lq",
      "post_id": "1ivq6dn",
      "post_title": "schizophrenic turned investor",
      "comment_body": "I thought CIA concerns overseas ops. You bet on US market so it's FBI who handles you regard.",
      "score": 3,
      "created_utc": 1740251129.0
    },
    {
      "comment_id": "me6egby",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "Just double up on your positions while they're down, so when they rebound, you make even more (its never worked when I tried, but maybe it will work for you)",
      "score": 19,
      "created_utc": 1740238255.0
    },
    {
      "comment_id": "me6ln4l",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "Everyone is. So don’t worry.",
      "score": 5,
      "created_utc": 1740240413.0
    },
    {
      "comment_id": "me7a53x",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "Every other call is 1-2 years out so what? Is this rage bait? ![img](emote|t5_2th52|4271)",
      "score": 2,
      "created_utc": 1740247420.0
    },
    {
      "comment_id": "me6gsig",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "That money is already gone right? So stop checking it if you aren’t gonna sell and let the dice roll.",
      "score": 1,
      "created_utc": 1740238960.0
    },
    {
      "comment_id": "me6zq88",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "You’re down 23% on the Pltr with 30 days or so left. Probably the only one here that is at risk really. The rest of your plays 2026 leaps and 2027 have not even began to cook. If I have to sell at a loss. The 20-30% down is not as bad. Really I don’t think your cooked at all just got to know what your risk tolerance is. If you freak out and tell your wife you will only create panic with her. Just hold those balls out and be confident in your plays. Or take the 23% loss and move on to another trade. Or diamond balls PLTR and see what happens.",
      "score": 1,
      "created_utc": 1740244479.0
    },
    {
      "comment_id": "me6f764",
      "post_id": "1ivixub",
      "post_title": "DD on Intuitive Machines (LUNR) second moon mission next Wednesday (Feb 26th)",
      "comment_body": "Reading stocktwits on stockanalysis is my favorite pastime.\n\nPeople were so mad and blaming WSB for getting them into the stock when the entire market fell last week 😂 those people are psychotic",
      "score": 22,
      "created_utc": 1740238484.0
    },
    {
      "comment_id": "me3ghal",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "Worst day of 2025….\n\n… so far!",
      "score": 1696,
      "created_utc": 1740190752.0
    },
    {
      "comment_id": "me3yzdy",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "I actually think they will allow the market to crash. It’s so early, that trunk will say it’s Biden fault, and let all the billionaires buy it all up cheap",
      "score": 201,
      "created_utc": 1740197757.0
    },
    {
      "comment_id": "me3kp9g",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "I hope we send Tesla to $10 so Elon’s net worth crumbles to where it belongs.",
      "score": 96,
      "created_utc": 1740192289.0
    },
    {
      "comment_id": "me40x19",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "It's not tariff fears this time. \n\nWMT lowered guidance, predicting weak sales for 2025, and that is killing retail and advertising. Meanwhile, a new COVID virus was discovered by the Wuhan lab, so healthcare stocks are benefitting.",
      "score": 13,
      "created_utc": 1740198567.0
    },
    {
      "comment_id": "me46yeh",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "so if he doesn't open his mouth this weekend, then we get a bounce monday? pls mango, don't talk!",
      "score": 11,
      "created_utc": 1740201161.0
    },
    {
      "comment_id": "me3h21o",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "So far...",
      "score": 4,
      "created_utc": 1740190961.0
    },
    {
      "comment_id": "me3r8rr",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "So we continuing in the put train or so we expect calls on Monday?\n\nSomeone help, my loss porn is going to be epic one way or another",
      "score": 2,
      "created_utc": 1740194692.0
    },
    {
      "comment_id": "me49znc",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "Using Dow as a metric is inaccurate compared to SPY. It’s only 30 stocks so one of them having a bad day can skew the index. Its also mostly boomer shit (+nvidia) so it’s really a metric for boomer stocks\n\nSpy should be the default for headlines",
      "score": 2,
      "created_utc": 1740202549.0
    },
    {
      "comment_id": "me4ezkq",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "So far…",
      "score": 2,
      "created_utc": 1740205013.0
    },
    {
      "comment_id": "me4ihe8",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "I bought the dip so many times today it just wouldn’t stop",
      "score": 2,
      "created_utc": 1740206839.0
    },
    {
      "comment_id": "me3lppt",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "Dow is price weighted, not cap weighted.\n\nSo it is heavily weighted towards United health, which coincidentally has allegations of screwing the US government out of billions with phony diseases.  Which hits two items on the Trump bingo card. Waste, fraud, and abuse and inflating medical diseases to make the president look bad.\n\nAdditionally,  Google which is a large component of both S&P and Dow index, had a story about being charged with violating the EU Digital Markets Act.  That could result in heavy fines that could take a few percentage points of yearly profits.",
      "score": 3,
      "created_utc": 1740192659.0
    },
    {
      "comment_id": "me5jhcy",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "Trump crashed economy by 2019 last time so he’s really living fast now",
      "score": 1,
      "created_utc": 1740227228.0
    },
    {
      "comment_id": "me5o2aq",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "So it wasn't baked in afterall",
      "score": 1,
      "created_utc": 1740229200.0
    },
    {
      "comment_id": "me66ypd",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "*so far*",
      "score": 1,
      "created_utc": 1740235912.0
    },
    {
      "comment_id": "me4rst7",
      "post_id": "1iv3i8r",
      "post_title": "Last play NVDA Yolo",
      "comment_body": "bro i will open a 5k short on monday, so u can make money alright",
      "score": 5,
      "created_utc": 1740211970.0
    },
    {
      "comment_id": "me65w5u",
      "post_id": "1iv3i8r",
      "post_title": "Last play NVDA Yolo",
      "comment_body": "lol everyone feels this way right now. \n\nwhat will happen when everyone feels this way if they act on it? \n\nthis coming ER dip with be THE dip to buy, (what's more every one else is thinking this, I'll sell 140'ish and buy back the dip) Maybe this is why NVDA dropped 4%, instead of 2'ish) \n\nThat said, as much as people want out \"for good\"...it's because they feel no chances for these 165-195 12 month out price predictions anytime soon. \n\n  \n100% the ER dip rebound will hit the previous ath....and up and down up and down the stock will go.   \n  \nWhat sucks is head out my ass look at market, NVDA is NOT a highest MC company at this point...yes if Jensen's visions play out.  but as at now, even #2 mc is REALLY confident it will get there. \n\nSo NVDA will only poke it's head into highest MC, peeps sell it back down once it does. \n\n  \nhowever until concretely into NVDA is powering an \"industrial revolution\" it may touch highest MC but never stay there.  \n\nMarket so over valued, am comparing business model and prospects as compared to their respective market caps lol  \n\nAm sincerely surprised market values NVDA more than MSFT, but is obviously because of potentials, not anything realized. MSFT even already has their AI fuck up price in.",
      "score": 6,
      "created_utc": 1740235564.0
    },
    {
      "comment_id": "me2kl43",
      "post_id": "1iv2bbm",
      "post_title": "BABA puts !",
      "comment_body": "I don't dislike playing the volatility, hope it works out. I don't see the next resistance till 150 so I think untill 140 breaks, 150 is a magnet. Good luck,",
      "score": 2,
      "created_utc": 1740177266.0
    },
    {
      "comment_id": "me2r6lx",
      "post_id": "1iv2bbm",
      "post_title": "BABA puts !",
      "comment_body": "Nice. I bought it when it was at $245 2 days ago so im basically flat today. I expect AAPL to dump further. Its going up in hopes and dreams right now",
      "score": 1,
      "created_utc": 1740179302.0
    },
    {
      "comment_id": "me3u40x",
      "post_id": "1iv2bbm",
      "post_title": "BABA puts !",
      "comment_body": "Expiry on this so we can see who laughs at end?",
      "score": 2,
      "created_utc": 1740195796.0
    },
    {
      "comment_id": "me4aoh3",
      "post_id": "1iv2bbm",
      "post_title": "BABA puts !",
      "comment_body": "I just looked to see if I misremembered and on the day of earnings before the news, PLTR’s RSI was 80. So yeah.",
      "score": 1,
      "created_utc": 1740202877.0
    },
    {
      "comment_id": "me4jpbx",
      "post_id": "1iv1ju0",
      "post_title": "AMD turned me into a gambling addict",
      "comment_body": "Well the house always wins so…",
      "score": 1,
      "created_utc": 1740207494.0
    },
    {
      "comment_id": "me510f5",
      "post_id": "1iv1ju0",
      "post_title": "AMD turned me into a gambling addict",
      "comment_body": "Playing the earnings is roulette. My policy is always to get out of the stock the day before earnings. Also, when I realize that I'm getting obsessed or enamored with a stock, I take it out from my following-portfolio. Stocks simply don't owe you anything, even if you have lost a lot of money on them. \n\nAMD has a PER of 100, it's on a downward trend, and belongs to a sector that is losing the market's preference. So it's a no-no until something changes. I'm sorry if this sounds too \"/r/investing\", but really, even the YOLO possibilities are almost null.",
      "score": 0,
      "created_utc": 1740217205.0
    },
    {
      "comment_id": "me4u510",
      "post_id": "1iv1ju0",
      "post_title": "AMD turned me into a gambling addict",
      "comment_body": "It went from $1.90 to $210 so",
      "score": 1,
      "created_utc": 1740213277.0
    },
    {
      "comment_id": "me4fxyh",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "I'm in GOOGL and WMT, so we're kind of in the same boat",
      "score": 1,
      "created_utc": 1740205505.0
    },
    {
      "comment_id": "me3ux57",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Just admit you missed the boat lmao. We are at the tail end of the biggest bull market in history, and you think it’s going to go up even more because “low rates = stocks go up.” Every company from AMD and AMZN to XYZ and WMT is giving poor guidance because consumers don’t have any more spending money, and yet the dip is still being bought because regards have been conditioned to do so over the last couple years. Lowering rates and cutting government spending means stagflation — we will see how much the market likes that!",
      "score": 6,
      "created_utc": 1740196111.0
    },
    {
      "comment_id": "me4nbad",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Ya so? Themes can last however long they want to.",
      "score": -2,
      "created_utc": 1740209466.0
    },
    {
      "comment_id": "me40rcl",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "So what’s your point exactly?",
      "score": 0,
      "created_utc": 1740198500.0
    },
    {
      "comment_id": "me3qex3",
      "post_id": "1iv07j8",
      "post_title": "Is this wsb enough for you?",
      "comment_body": "You didn’t full port so no",
      "score": 1,
      "created_utc": 1740194374.0
    },
    {
      "comment_id": "me1hgtz",
      "post_id": "1iuykwm",
      "post_title": "the sector you've never touched IS a 10-bagger, but not like that [DD w/ $250k invested)",
      "comment_body": "Robotics is the next huge play after AI imo so this is spot on",
      "score": 8,
      "created_utc": 1740165907.0
    },
    {
      "comment_id": "me4nm1s",
      "post_id": "1iuykwm",
      "post_title": "the sector you've never touched IS a 10-bagger, but not like that [DD w/ $250k invested)",
      "comment_body": "Commenting so I can check post later. Best of luck regards",
      "score": 2,
      "created_utc": 1740209637.0
    },
    {
      "comment_id": "me1ic38",
      "post_id": "1iuykwm",
      "post_title": "the sector you've never touched IS a 10-bagger, but not like that [DD w/ $250k invested)",
      "comment_body": "So we are going back in time to fuck up Mother Nature even more? Hard pass",
      "score": -10,
      "created_utc": 1740166152.0
    },
    {
      "comment_id": "me20g0n",
      "post_id": "1iuykwm",
      "post_title": "the sector you've never touched IS a 10-bagger, but not like that [DD w/ $250k invested)",
      "comment_body": "China revolutionizing nuclear energy with thorium. Proves to be more efficient. So idk about uranium",
      "score": 3,
      "created_utc": 1740171448.0
    },
    {
      "comment_id": "me2v7yu",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "Heres whats going to happen for nvidia earnings. Price is going to stabilise 130-135 before earnings. \n\nOnce market closes and report is out, NO MATTER what the result, beat this beat that beat meat missess whatever fk, NVIDIA is going to TANK. ISTG wtv stock thats in the hype industry, no matter their result their stock ALWAYS tank.\n\nSo I’m going to go 10k on 2/3DTE puts whenever earning is closer.\n\nNVIDIA will obvsly recover in the long run but I’m so sure of this play U’ll see my post about it when I buy nearer to the date. First time 🌈🐻",
      "score": 15,
      "created_utc": 1740180613.0
    },
    {
      "comment_id": "me194um",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "So I can't train my AI on chopstick logic gates? or worse, AMD cards?",
      "score": 80,
      "created_utc": 1740163560.0
    },
    {
      "comment_id": "me1joch",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "I got so many cheep shares it was insane",
      "score": 47,
      "created_utc": 1740166532.0
    },
    {
      "comment_id": "me1awdu",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "It doesn’t matter there’s so much hate from retailers who jumped ship way too early so they’ve turned into butthurt bers, that include hedge funds and institutions too.",
      "score": 8,
      "created_utc": 1740164051.0
    },
    {
      "comment_id": "me532sc",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "Steve cohen, ray dalio, Howard mark all said market is at its peak or at a bubble and correction is likely. So Jensen words wouldn’t help his stock",
      "score": 1,
      "created_utc": 1740218384.0
    },
    {
      "comment_id": "me1zk6g",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "They did... and thats why I profited. These idiot Harvard finance bros should react again so I can buy more options ![img](emote|t5_2th52|4258)",
      "score": 1,
      "created_utc": 1740171193.0
    },
    {
      "comment_id": "me29vyv",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "To be fair what he said about quantum stocks isn't new, it's been known way before that. It's just that the media decided to throw that headline everywhere to dump the quantum stocks. NVDA will have a quantum event next month too I think, so the quantum stocks should pump.",
      "score": 40,
      "created_utc": 1740174128.0
    },
    {
      "comment_id": "me5lrkc",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "Isn’t earnings literally coming Wednesday? So puts Monday?",
      "score": 3,
      "created_utc": 1740228245.0
    },
    {
      "comment_id": "me415fd",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "So inverse Reddit right",
      "score": 3,
      "created_utc": 1740198662.0
    },
    {
      "comment_id": "me2ax3c",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "I don't think hedge funds and institutions got hit much. The DeepSeek news was out since December, it was old news. The media/whales used that old news at the end of Jan to cause fear so they can buy the dip imo. Like it was all over the media suddenly during that weekend to manipulate.",
      "score": 3,
      "created_utc": 1740174421.0
    },
    {
      "comment_id": "me6rnh0",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "Normally it would rally till earnings, crash after earnings because its priced to perfection. This time its relatively cheap so it might actually rally after earnings",
      "score": 4,
      "created_utc": 1740242247.0
    },
    {
      "comment_id": "me23hpm",
      "post_id": "1iuy180",
      "post_title": "6 months of trading +107k 💰",
      "comment_body": "I try to be disciplined and have targets I trim at. I always try to leave a few runners. I'm watching price action all day so if I see it start to turn I'll sell.\n\nA majority of my trades are position trades. I occasionally do low expiry contracts and get very lucky. Always a risk reward calculation though.\n\nAs for if this is sustainable, I do expect some regression back to the mean. I try to be very careful with bankroll management so one trade doesn't blow me out.\n\nKnowing when to take a loss is as important as knowing when to take a win.",
      "score": 1,
      "created_utc": 1740172317.0
    },
    {
      "comment_id": "me2vkr2",
      "post_id": "1iuxz7j",
      "post_title": "Just doubled down on NVDA earnings with NVDL call options, relatively low risk but hopefully will payoff.",
      "comment_body": "Hahaha goodluck poor, no matter NVDA’s result, its going to tank. Ill put my money where my mouth is nearer to earnings date so that theta dont fk my ass too much",
      "score": 0,
      "created_utc": 1740180730.0
    },
    {
      "comment_id": "me1tb9c",
      "post_id": "1iuwn10",
      "post_title": "Hims has coke d!6k",
      "comment_body": "So now the question is, is there a future in mass marketed boner pills?",
      "score": 3,
      "created_utc": 1740169268.0
    },
    {
      "comment_id": "me0oj2g",
      "post_id": "1iuvlr8",
      "post_title": "Rivian $6.6B Loan from DOE Will Likely Be Cut",
      "comment_body": "But no of course there is no conflict of interest with Musk, he just wants to do what’s best… right? God this shit is dumb. I don’t even care about it from a stock perspective, just the fact that this is probably going to happen this time and likely every time after for the next 4 years is so fucked up.",
      "score": 168,
      "created_utc": 1740157875.0
    },
    {
      "comment_id": "me19suy",
      "post_id": "1iuvlr8",
      "post_title": "Rivian $6.6B Loan from DOE Will Likely Be Cut",
      "comment_body": "So he won?",
      "score": 2,
      "created_utc": 1740163744.0
    },
    {
      "comment_id": "me0ydzp",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "so that's why inverse Tesla was printing today",
      "score": 1,
      "created_utc": 1740160583.0
    },
    {
      "comment_id": "me0cjbw",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "It’s not clickbait, it’s legally classed as a recall.\n\nEdit: I can’t respond to the dipshit below me so I’m posting it here. Here’s the recall page on Tesla’s own site detailing firmware updates as examples of recalls:\n\nhttps://www.tesla.com/en_gb/support/annual-and-recall-service",
      "score": 22,
      "created_utc": 1740154531.0
    },
    {
      "comment_id": "me6ivzb",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "Musk can go fuck himself, but owning a Tesla is legitimately great. \n\nI needed my tires rotated recently. Local shops will do it for $50 +/- $5. Tesla does it for $60, in my driveway. Dude turns up in a Model S of all things and was done in 10 minutes. Nice guy, hands down the best simple car maintenance experience I’ve ever had for a $10 premium. Awesome.\n\nEvery employee has been very chill and helpful. \n\nThe charging network is ubiquitous and reliable, there’s even tons of free level 2 chargers provided by Tesla. (Destination chargers, how many other car companies are just handing out free fuel?)\n\nThe software is the best in the industry and it’s not close. CarPlay and android auto isn’t available and it doesn’t even matter.\n\nSo long as you ignore its CEO, there’s a lot to like about Tesla.",
      "score": 1,
      "created_utc": 1740239582.0
    },
    {
      "comment_id": "me0ezyq",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "That's why it's clickbait.  It's not a literal lie because it's technically true based on the legal definition...but they don't mention that it's just an over the air update in the headline so they can bait you into clicking on it thinking it's something more serious.\n\nThis is the definition of clickbait.",
      "score": 13,
      "created_utc": 1740155225.0
    },
    {
      "comment_id": "me18chm",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "The NHTSA flags OTA update recalls separately from physical recalls now, so it’s really not a legal classification anymore. It’s just media hoping to get clicks",
      "score": 5,
      "created_utc": 1740163342.0
    },
    {
      "comment_id": "me0q9fq",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "FYI copying a person is the ultimate form of flattery and indicates that at least on a subconscious level you agree with that person.  \n\nSo by you saying “wow” after like me, means you agree with me.\n\nAlso, it’s “read only” and recommend for Doge, actually changes will happen when congress passes next budget.\n\nEducate yourself.",
      "score": -7,
      "created_utc": 1740158353.0
    },
    {
      "comment_id": "me3sbix",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "It’s also someone trying to crash the stock price so they can get some.",
      "score": 0,
      "created_utc": 1740195104.0
    },
    {
      "comment_id": "me2tnvp",
      "post_id": "1iuu4oi",
      "post_title": "Intel's 18A process producing SRAM density on par with TSM's N2 porcess",
      "comment_body": "I was trying to get 1000 shares at an average price below $20 but ended up with only 600. So of course it's mooning",
      "score": 3,
      "created_utc": 1740180099.0
    },
    {
      "comment_id": "me1nrhd",
      "post_id": "1iuu4oi",
      "post_title": "Intel's 18A process producing SRAM density on par with TSM's N2 porcess",
      "comment_body": "This stock is so bad everybody please sell you don't want no part of this shit. Sell now sell for cheap.",
      "score": 0,
      "created_utc": 1740167677.0
    },
    {
      "comment_id": "me09kuq",
      "post_id": "1iuu4oi",
      "post_title": "Intel's 18A process producing SRAM density on par with TSM's N2 porcess",
      "comment_body": "There is no news on the yields...\n\n\nThen again people have been saying false things about density for a while now too. \n\n\nWhich is good, it's why the price was so cheap and such an easy investment :D",
      "score": 8,
      "created_utc": 1740153682.0
    },
    {
      "comment_id": "me0npg9",
      "post_id": "1iuu4oi",
      "post_title": "Intel's 18A process producing SRAM density on par with TSM's N2 porcess",
      "comment_body": "5x wouldn't be that much. TSMC is worth 10x what Intel is now. So if Intel even takes half of the market and valuation, then we are at 5x (and that's on chip fab alone, ignoring anything they do in terms of GPUs and working to take market share from NVDIA.... and since NVDIA seems to be messing up with their latest GPUs, there is a chance for ground to be gained there).",
      "score": 7,
      "created_utc": 1740157645.0
    },
    {
      "comment_id": "me27ch3",
      "post_id": "1iuu4oi",
      "post_title": "Intel's 18A process producing SRAM density on par with TSM's N2 porcess",
      "comment_body": "So like... $50 call for next Jan a good play you think, or would you recommend just buying in?",
      "score": 1,
      "created_utc": 1740173408.0
    },
    {
      "comment_id": "me1d02d",
      "post_id": "1iuu4oi",
      "post_title": "Intel's 18A process producing SRAM density on par with TSM's N2 porcess",
      "comment_body": "I don’t think the leadership has changed,so….",
      "score": 4,
      "created_utc": 1740164643.0
    },
    {
      "comment_id": "me0ox85",
      "post_id": "1iuu4oi",
      "post_title": "Intel's 18A process producing SRAM density on par with TSM's N2 porcess",
      "comment_body": "I am not so fond of Intels product side. I also dont think graphic cards will move their bottom line. But they are valued so immensly cheap, that i dont see any risk at this point. \n\nA buyout would also just limit the potential upside.",
      "score": 6,
      "created_utc": 1740157984.0
    },
    {
      "comment_id": "mdztb1b",
      "post_id": "1iuprio",
      "post_title": "$DBX Guidance Flop: Still holding",
      "comment_body": "https://preview.redd.it/nkiash2t7ike1.png?width=1055&format=png&auto=webp&s=83f99c6b8df91fbe317938a98173d20918bf6e6a\n\nJoined you my bro, dbx always send my wife's boyfriend email for deleting his account for a year so it should be below 20.",
      "score": 3,
      "created_utc": 1740148887.0
    },
    {
      "comment_id": "mdzq2cq",
      "post_id": "1iuprio",
      "post_title": "$DBX Guidance Flop: Still holding",
      "comment_body": "Curious to know why so long - Jan 2026??",
      "score": 1,
      "created_utc": 1740147850.0
    },
    {
      "comment_id": "mdzjpo2",
      "post_id": "1iupem5",
      "post_title": "DOJ Investigates Medicare Billing Practices at UnitedHealth",
      "comment_body": "the CURRENT doj? lol.IF they do any actual investigation,it is to see what UH is doing, so they can implement it across all healthcare insurers.",
      "score": 1,
      "created_utc": 1740145724.0
    },
    {
      "comment_id": "mdzb4k9",
      "post_id": "1iupem5",
      "post_title": "DOJ Investigates Medicare Billing Practices at UnitedHealth",
      "comment_body": "I’m so sorry to hear that, they really are a bunch of fucking crooks. Go after every last penny they owe you and don’t settle for less.",
      "score": 187,
      "created_utc": 1740142545.0
    },
    {
      "comment_id": "mdzngrx",
      "post_id": "1iupem5",
      "post_title": "DOJ Investigates Medicare Billing Practices at UnitedHealth",
      "comment_body": "what did they think your baby was enjoying themselves so much they decided to stay an extra day?",
      "score": 97,
      "created_utc": 1740146997.0
    },
    {
      "comment_id": "me04tb9",
      "post_id": "1iupem5",
      "post_title": "DOJ Investigates Medicare Billing Practices at UnitedHealth",
      "comment_body": "This is nothing. The investigation hitting just as luigi first court appearance is coming is no coincidence - they just want to placate the poors so another one of them or their families doesnt get the luigi special.",
      "score": 59,
      "created_utc": 1740152335.0
    },
    {
      "comment_id": "mdzkqnc",
      "post_id": "1iupem5",
      "post_title": "DOJ Investigates Medicare Billing Practices at UnitedHealth",
      "comment_body": "The admin is kind of nutty. \n\nBut they've been harping on how horrible PBMs are. \n\nThis is focused on billing, but UNH does own a PBM. So not sure if it'll be impacted or not. \n\n>“We are paying far too much, because we are paying far more than other countries. We have laws that make it impossible to reduce [drug costs] and we have a thing called a ‘middleman’ … that makes more money than the drug companies, and they don’t do anything except they’re middlemen. We are going to knock out the middleman. \n\nhttps://www.nacds.org/news/in-case-you-missed-it-president-elect-trump-affirms-commitment-to-pbm-reform-in-two-national-media-events-in-one-week/",
      "score": 31,
      "created_utc": 1740146076.0
    },
    {
      "comment_id": "me1l85o",
      "post_id": "1iumfsb",
      "post_title": "RDDT loss porn - I can’t stop buying.",
      "comment_body": "-18% for me lol. But mooom, my dip keeps on dipping\n\nImagine being regarded enough to expect the stock to moon after good earnings, so you buy even more...",
      "score": 1,
      "created_utc": 1740166967.0
    },
    {
      "comment_id": "me02ce7",
      "post_id": "1iumfsb",
      "post_title": "RDDT loss porn - I can’t stop buying.",
      "comment_body": "the floor is 160, so i owuldnt sell",
      "score": 2,
      "created_utc": 1740151623.0
    },
    {
      "comment_id": "mdz2cde",
      "post_id": "1iumfsb",
      "post_title": "RDDT loss porn - I can’t stop buying.",
      "comment_body": "Yup it's corporate time now, wonder if they gonna relax on the bans just to so they can say they have more users",
      "score": 1,
      "created_utc": 1740138720.0
    },
    {
      "comment_id": "mdz3cwh",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "If you are wondering why Tesla stock is not plummitting with all the anger on Reddit.  Nissan is likely expecting Tesla to compete with China in Russia when US gains access to that market and Tesla to take over the India market and gain ground in the Japanese markets since China has a hard time gaining access.  Even if Tesla loses all of 300k sales in Europe and 60k sales per year in Canada.  He expect to more than make up for it those countries.   So yes people in Western nations can try to boycott his products even in the US, but he is expanding into markets where Western culture is less celebrated.  Also if you want to travel long distances effectively with EVs in the US the only option currently is using Tesla Superchargers which have a 20-30% markup and subscription.",
      "score": -33,
      "created_utc": 1740139204.0
    },
    {
      "comment_id": "me7n6dc",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "This is precisely why the Communist Chinese govt has been pressing for the West to move to EVs sooner than later.   They couldn't come up with competitive ICE designs, but EVs are a lot easier for them.\n\nIn the US, at least, the recharging infrastructure is terrible.  If you live in Southern California it might seem great, but the nation is vast.  And much of that vastness has no recharging stations among large populations.  People still desire ICE vehicles and probably will for the near to mid future.\n\nYet it will be interesting to see the true reliability reports of those cars, if they ever see light of day.  \n\nThe other aspect is manufacturer support... \n\nAnd just remember more tech means more things to get outdated and/or break.  Short term it shows great for reviews, but long term is what really matters.  So I remain skeptical of your claim..  Just because the car was impressive to you doesn't mean it is going to resonate with others, who have other considerations beyond being geeked out from all the tech.",
      "score": 1,
      "created_utc": 1740251158.0
    },
    {
      "comment_id": "mdzif5j",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "Also electric cars don’t do so great in the extreme cold.",
      "score": 9,
      "created_utc": 1740145270.0
    },
    {
      "comment_id": "mdzrpzv",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "Yes, but they're Hondas.  Again, it's not the technical ability to make a car that has value.  Having distinct tiered brands with different markets to target does.  It's why McDonald's, despite owning a huge chunk of Chipotle, never branded themselves as McMexican or whatever, despite the product being very well liked.  It's why Luxottica could save SO MUCH by just branding everything Luxottica, or take a higher brand name like their Prada line and slap it on the cheaper brands, but they don't.  They don't hate savings.  They understand branding and demographics\n\n\nYoung kids rarely want to buy the same brand their parents do.  From an advertising side, an ad campaign aimed at getting middle aged folks to see Honda as a reliable value is going to hurt an ad campaign aimed at showing the Honda City as young, hip, yet unique.  \n\n\nThey do sell the HR-V in the US.",
      "score": 3,
      "created_utc": 1740148382.0
    },
    {
      "comment_id": "mdyt7k6",
      "post_id": "1iuhlv3",
      "post_title": "BKSY BlackSky, the Most Interesting Space Stock You Haven't Heard Of",
      "comment_body": "I've been in this ticker since December and I promise 99% of you are worse investors than me.\n\nI'm still holding.\n\n\nMy thesis when I bought, without even reading OPs post was that AI is going to be heavily favored on companies who *already have massive stores of data with the ability to gather more.*\n\n\nCompanies with large amounts of data that is easily trainable on AI are going to be the new frontier for growth. I also bought $PL for the same reason. Both of these companies have since either won or been approved as a major vendor for government global imaging projects. \n\n\nI heard of them while chatting with chatgpt about companies in the space sector that are hoarding data. These two companies seemed like major players in this game. $PL I'm actually shocked hasn't gone up as much given they have imaged the entire early every day for over a decade. The amount of data is wild. Though only recently do they seem to be utilizing this for military applications when previously it was mostly aimed at climate change.\n\n\nKeep in mind, I also bought TEM based on this. A lot of my insanely profitable plays over the last couple months have been trying to identify which companies can utilize the next stage for AI, which is piles of data, and which companies are already set in their field to continue to do so. Once I heard BKSY was going up with RKLB, I bought more and have continued to do so.\n\n\nIf I'm being honest, I don't like seeing this on this sub lol. It'll turn into a pump and dump but I legitimately like the company. I'd prefer if people piled in, you all paced yourselves so I could save myself the emotional turmoil I'm currently in with TEM lol.",
      "score": 16,
      "created_utc": 1740133806.0
    },
    {
      "comment_id": "mdyehrp",
      "post_id": "1iuhlv3",
      "post_title": "BKSY BlackSky, the Most Interesting Space Stock You Haven't Heard Of",
      "comment_body": "Glad to see it here. I have $12.5 calls expiring in May I bought a few weeks ago at 3.5.  Not sure if there will be a pull back but so far it's been good .",
      "score": 3,
      "created_utc": 1740125037.0
    },
    {
      "comment_id": "mdxsrk8",
      "post_id": "1iuhlv3",
      "post_title": "BKSY BlackSky, the Most Interesting Space Stock You Haven't Heard Of",
      "comment_body": "It is not super obscure. At the same time, it does not see tons of volume, there has been zero posts on it so far:\n\n[https://www.reddit.com/r/wallstreetbets/search/?q=bksy&cId=8d0909ff-0e52-4a11-b459-504443522952&iId=5771b726-03af-4343-8200-cf1c490cd30f](https://www.reddit.com/r/wallstreetbets/search/?q=bksy&cId=8d0909ff-0e52-4a11-b459-504443522952&iId=5771b726-03af-4343-8200-cf1c490cd30f)\n\nSo I am guessing it might be new to some people",
      "score": 7,
      "created_utc": 1740114207.0
    },
    {
      "comment_id": "mdxo7jd",
      "post_id": "1iudhkc",
      "post_title": "Caught PLTR puts right before the drop 1362%",
      "comment_body": "Oh, so it was you who drop kicked PLTR!",
      "score": 4,
      "created_utc": 1740112455.0
    },
    {
      "comment_id": "me1wewd",
      "post_id": "1iudhkc",
      "post_title": "Caught PLTR puts right before the drop 1362%",
      "comment_body": "How do you guys time it so well?",
      "score": 3,
      "created_utc": 1740170218.0
    },
    {
      "comment_id": "mdwct5z",
      "post_id": "1iucp16",
      "post_title": "NVDA yolo",
      "comment_body": "“Dealers lost SPX”\n\nMy friend you are about to find out why 6080 not breaking and closing over 6100 is so significant",
      "score": 18,
      "created_utc": 1740095650.0
    },
    {
      "comment_id": "mdy5unx",
      "post_id": "1iucp16",
      "post_title": "NVDA yolo",
      "comment_body": "Rhetorical question: Why are bears all so fucking poor? ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)",
      "score": 8,
      "created_utc": 1740120240.0
    },
    {
      "comment_id": "mdx7x7f",
      "post_id": "1iucp16",
      "post_title": "NVDA yolo",
      "comment_body": "Dealers don’t lose battles, they hedge. It’s mopex with a fuck ton of gamma rolling off opening a window for heightened volatility if you willl. You contracts expire tomorrow tho so u are most probably doomed",
      "score": 2,
      "created_utc": 1740106688.0
    },
    {
      "comment_id": "mdxyvrz",
      "post_id": "1iucp16",
      "post_title": "NVDA yolo",
      "comment_body": "Oh bro you are so fucked. That money is gone",
      "score": 2,
      "created_utc": 1740116824.0
    },
    {
      "comment_id": "mdwxnae",
      "post_id": "1iucp16",
      "post_title": "NVDA yolo",
      "comment_body": "Why are so many people salty",
      "score": 3,
      "created_utc": 1740103270.0
    },
    {
      "comment_id": "me1l7vz",
      "post_id": "1iucp16",
      "post_title": "NVDA yolo",
      "comment_body": "So what’s the next move",
      "score": 1,
      "created_utc": 1740166965.0
    },
    {
      "comment_id": "me060a0",
      "post_id": "1iucp16",
      "post_title": "NVDA yolo",
      "comment_body": "Yes, I know. NVDA was also red 11/13 to 11/18. Maybe MMs want to drive the stock down so they can get a better price in the lead up to earnings, getting paper handers to sell at the low before earnings, and regards to buy at the high and hold them bags after.\n\nNot saying it will happen this time, I ain't playing NVDA on a Friday, but I can see where OP is going. We here to make money, long or short - it's good to be open minded.",
      "score": 2,
      "created_utc": 1740152673.0
    },
    {
      "comment_id": "mdxnf00",
      "post_id": "1iucp16",
      "post_title": "NVDA yolo",
      "comment_body": "The markets are showing signs of weakness despite the industry tied to them not necessarily having any reason to prompt it so. Some of course are valid but....Markets gonna be illogical",
      "score": 3,
      "created_utc": 1740112179.0
    },
    {
      "comment_id": "mdw50j3",
      "post_id": "1iub8fm",
      "post_title": "All IN CELH M23",
      "comment_body": "What you can do with that money is transfer me 1k so I can buy puts on CELH and win.",
      "score": 0,
      "created_utc": 1740093172.0
    },
    {
      "comment_id": "mdwgnkl",
      "post_id": "1iu8z2i",
      "post_title": "5000 shares in INTC",
      "comment_body": "So you bought mine before they started moving up again ![img](emote|t5_2th52|31225)\n\nhttps://preview.redd.it/utvbqibfxdke1.png?width=1636&format=png&auto=webp&s=27d891662caea1fee417422a521fbdfcb0aa1da1",
      "score": 1,
      "created_utc": 1740096893.0
    },
    {
      "comment_id": "me484x9",
      "post_id": "1iu8z2i",
      "post_title": "5000 shares in INTC",
      "comment_body": "I would have waited for a bit, the price is artificially pumped cause of rumors that there will be a break up of the company and parts sold or partnerships with other semiconductor manufacturers. Let’s be real that’s not gonna happen. Especially after the federal government already gave Intel a ton of subsidies. The current administration is not going to be happy with this at all, so there are going to be arguments that it’s national defense and what not to keep Intel as is. It’s a matter of time and you will see this back in the $20 range. I believe in Intel, I bought in at $19.48 sold at $25.75. There is going to be a better buying opportunity in the near future.",
      "score": 1,
      "created_utc": 1740201691.0
    },
    {
      "comment_id": "mdvlhgt",
      "post_id": "1iu8z2i",
      "post_title": "5000 shares in INTC",
      "comment_body": "Do you think current and future US leadership want the semiconductor industry to rely so hard on Korea and Taiwan? ",
      "score": 5,
      "created_utc": 1740087475.0
    },
    {
      "comment_id": "mdw16u3",
      "post_id": "1iu8z2i",
      "post_title": "5000 shares in INTC",
      "comment_body": "Yep, domestic domestic domestic and more protective market. It feels so good to front run smart money and ofc all of you ahahaha. I appreciate the exit liquidity, it’s almost time to buy again ;)",
      "score": 6,
      "created_utc": 1740092006.0
    },
    {
      "comment_id": "me1jvnm",
      "post_id": "1iu7nm4",
      "post_title": "Talk about an emotional day",
      "comment_body": "I know a guy that sold 100s of shares at $340 and then was a little upset that he didn’t sell at $350… now he’s so damn happy he sold",
      "score": 1,
      "created_utc": 1740166589.0
    },
    {
      "comment_id": "mdz99vq",
      "post_id": "1iu7nm4",
      "post_title": "Talk about an emotional day",
      "comment_body": "Yep. So it seems. But dude, what a well run company with a great future.   It will go up… but looks like it will take longer than I hoped",
      "score": 2,
      "created_utc": 1740141803.0
    },
    {
      "comment_id": "mdvfhvg",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "Earnings beat but they beat every Q so wait the call out",
      "score": 10,
      "created_utc": 1740085799.0
    },
    {
      "comment_id": "mdvieil",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "So glad I got next week and the week after puts. IV was low low. Looks like it’s going the right direction for a company that isn’t growing (hopefully it keeps trending).",
      "score": 3,
      "created_utc": 1740086610.0
    },
    {
      "comment_id": "mdvvwy6",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "So like no growth in 2025",
      "score": 3,
      "created_utc": 1740090456.0
    },
    {
      "comment_id": "mdw4axu",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "Hold up. Stock dropped so far in the afternoon hours! Let’s go!",
      "score": 3,
      "created_utc": 1740092952.0
    },
    {
      "comment_id": "mdx4ha0",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "I got you homie, my office is switching to Sharepoint rn, I'll get on the horn so they can hop to it right quick",
      "score": 3,
      "created_utc": 1740105539.0
    },
    {
      "comment_id": "mdxyx3w",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "I'm a drop box stock dropping expert. The drop last February took a week or so even though it looks like 1 day on the 5 year chart. Safer to do March Puts and let it slowly fizzle over time.",
      "score": 3,
      "created_utc": 1740116841.0
    },
    {
      "comment_id": "mdv6blw",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "I'm going to inverse this so hard.",
      "score": 2,
      "created_utc": 1740083248.0
    },
    {
      "comment_id": "mdukvgo",
      "post_id": "1iu5zsq",
      "post_title": "Sell for a loss or hold? RDDT Calls",
      "comment_body": "July is so far away why the fuck would you sell for a loss?",
      "score": 56,
      "created_utc": 1740077359.0
    },
    {
      "comment_id": "mduqaln",
      "post_id": "1iu5zsq",
      "post_title": "Sell for a loss or hold? RDDT Calls",
      "comment_body": "im surprised the call is still so expensive. iv must be high",
      "score": 1,
      "created_utc": 1740078843.0
    },
    {
      "comment_id": "mdx08y9",
      "post_id": "1iu5zsq",
      "post_title": "Sell for a loss or hold? RDDT Calls",
      "comment_body": "You have 5 months until expiration. You’ve seen the crazy shit the market has done the last few weeks, so there’s absolutely no telling what’s coming over the next 5 months. You can paper hand these things now, but that’s the dumb thing to do.",
      "score": 1,
      "created_utc": 1740104124.0
    },
    {
      "comment_id": "mdum8if",
      "post_id": "1iu5zsq",
      "post_title": "Sell for a loss or hold? RDDT Calls",
      "comment_body": "If I lost it all, it would wipe out my YTD gains for the year, so can afford to lose it all, but don’t want to of course (who does?).",
      "score": 2,
      "created_utc": 1740077729.0
    },
    {
      "comment_id": "mdwqtw5",
      "post_id": "1iu5zsq",
      "post_title": "Sell for a loss or hold? RDDT Calls",
      "comment_body": "I haven't purchased something through an Ad anywhere, ever. Yet you have billions being spent on marketing and companies like META and Google earning their valuations through ad revenue. So this point isn't valid IMO",
      "score": 5,
      "created_utc": 1740101054.0
    },
    {
      "comment_id": "mdur514",
      "post_id": "1iu5zsq",
      "post_title": "Sell for a loss or hold? RDDT Calls",
      "comment_body": "A few ending this week, a few next week and a few more at a lil bit later date..  I’m down a few k so far…",
      "score": 1,
      "created_utc": 1740079074.0
    },
    {
      "comment_id": "mduqxq7",
      "post_id": "1iu5zsq",
      "post_title": "Sell for a loss or hold? RDDT Calls",
      "comment_body": "Max hysteria most likely won't peak until November or December of this year, and Reddit being a meme stock and all it may actually moon with the rest of the meme stocks and cryptocurrencies before crashing and burning, so your July calls may print some pretty big returns, but as with everything in this game, there's no guarantees.",
      "score": -4,
      "created_utc": 1740079019.0
    },
    {
      "comment_id": "mdv2tas",
      "post_id": "1iu5ybi",
      "post_title": "$PLTR will do a 10%+ nosedive tomorrow opening.",
      "comment_body": "PLTR is going up:\n\n1) DOGE is killing competitors in govt defense spending to fund PLTR.\n\n2) PLTR has Musk and Vance in their pocket.\n\n3) The CEO selling $1B is reduced from the original $6B so this is an improvement.\n\n4) OP holds puts so PLTR will rocket to new historical highs.",
      "score": 22,
      "created_utc": 1740082267.0
    },
    {
      "comment_id": "me1ip83",
      "post_id": "1iu5ybi",
      "post_title": "$PLTR will do a 10%+ nosedive tomorrow opening.",
      "comment_body": "Haha should have bought next week's puts. Idk what I was thinking. But hey, I'm right though, 5% dive so far.",
      "score": 3,
      "created_utc": 1740166255.0
    },
    {
      "comment_id": "me3fd2p",
      "post_id": "1iu5ybi",
      "post_title": "$PLTR will do a 10%+ nosedive tomorrow opening.",
      "comment_body": "So how did this work out for you ?",
      "score": 3,
      "created_utc": 1740190347.0
    },
    {
      "comment_id": "mdva96v",
      "post_id": "1iu5ybi",
      "post_title": "$PLTR will do a 10%+ nosedive tomorrow opening.",
      "comment_body": "Truly the smartest person ever. Military will not be cutting money from their most important sector of war which is data analytics and the potential advancement of AI in war. But market always does what no one thinks so good luck lol",
      "score": 2,
      "created_utc": 1740084340.0
    },
    {
      "comment_id": "me0c7v1",
      "post_id": "1iu5ybi",
      "post_title": "$PLTR will do a 10%+ nosedive tomorrow opening.",
      "comment_body": "How can you be so regarded?",
      "score": 2,
      "created_utc": 1740154439.0
    },
    {
      "comment_id": "mdum0ya",
      "post_id": "1iu5ybi",
      "post_title": "$PLTR will do a 10%+ nosedive tomorrow opening.",
      "comment_body": "Buying shares so you can win money.",
      "score": 1,
      "created_utc": 1740077673.0
    },
    {
      "comment_id": "mduknm8",
      "post_id": "1iu412h",
      "post_title": "Got an extra salary in 7 minutes (Thank you $PLTR)",
      "comment_body": "I’d been sitting on 100 contracts $80 puts for a few days bought @ $.44 and sold after the initial 10% drop yesterday at $.71. If I’d waited until today they were at $2.60 at one point so missed out on additional $20K in profits. But I still profited. Better than poke in the eye with a sharp stick I suppose.",
      "score": 27,
      "created_utc": 1740077300.0
    },
    {
      "comment_id": "mdwv8df",
      "post_id": "1iu412h",
      "post_title": "Got an extra salary in 7 minutes (Thank you $PLTR)",
      "comment_body": "so what I don't get is how in earth you timed this, or even thought to go in on this.  PLTR had dipped like crazy first thing and was on a slow steady rise until about when you bought - then it had a small dip, and then you sold out..... was it luck that got the timing right, or what? genuinely curious.",
      "score": 2,
      "created_utc": 1740102482.0
    },
    {
      "comment_id": "mduzs7h",
      "post_id": "1iu412h",
      "post_title": "Got an extra salary in 7 minutes (Thank you $PLTR)",
      "comment_body": "My whole portfolio was down like $20k and was like, \"Fuck it it's not down till I sell,\" and held everything for 3 years. I bought PLTR at $25 in 2021. My stop hit yesterday at $116.50. So now my whole portfolio is down $10k instead of $20k :(.",
      "score": 4,
      "created_utc": 1740081424.0
    },
    {
      "comment_id": "mdv4yxe",
      "post_id": "1iu412h",
      "post_title": "Got an extra salary in 7 minutes (Thank you $PLTR)",
      "comment_body": "And if u gonna smoke  meth, u probably gonna end up giving bj’s behind Wendy’s, so might as well go start practicing now and earn extra income",
      "score": 3,
      "created_utc": 1740082872.0
    }
  ],
  "statistics": {
    "total_mentions": 139,
    "total_upvotes": 11242,
    "post_mentions": 12,
    "comment_mentions": 127
  }
}