{
  "ticker": "COST",
  "posts": [
    {
      "post_id": "1iuxffd",
      "title": "Rivian (RIVN) Earnings Review - Bullish",
      "selftext": "TLDR: Rivian is a BUY, because it’s cheap  \n\nPost earnings call, Rivian has found gross profit, reducing vehicle production costs by $30k.  \n\nEyeing the R2 release in a year, they’ve sourced 95% of materials for it at half the cost of R1, seeing growing bargaining power in negotiations while realizing opportunities for production efficiencies.\n\nPeople are pumped about the R2 release.  \n\nWith $7B of cash they are guiding towards a <($2B) loss for 2025 -  \n\nleaving $5B of cash + $3.4B more from VW deal, putting them at a future $8.4B in cash alone for capex and expansion.  \n\nWhile the DOE loan might see pressure, they will also create **7500 US MANUFACTURING JOBS in Georgia**.  \n\nKilling manufacturing jobs isn’t really aligned with the current admin goals, even as they talk about ICE vehicles and the need to drill more.  \n\nGuidance for ‘25 was conservatively flat given the environment, however -  \n\nWith Tesla protests happening and a deep fleet of existing owners, the Tesla to Rivian trade-up is happening in force, which will especially add to R2 demand and existing R1 demand.  \n\nBetween R2 revenue at minimum $4.5B in ‘26, R1 sales, VW JV bringing in $2B in revenue (or more, as VW CEO has hinted at), potential further demand from other makers for Rivian tech,  \n\nAll of which doesn’t include EDV sales which just opened in February to other fleets, while they guide lower due to Amazon taking on slightly more orders in '24 and slightly less in '25, this is a unique differentiator that furthers the upside.\n\nRivian not only has a strong path to profitability, but likely future SPY inclusion as it reaches scale and profitability.  \n\nRivian is well capitalized, backed by big players who believe in their position, and most importantly -  \n\nPEOPLE LOVE THEIR PRODUCT.  \n\nIn the last year, Rivian is down 15%, while the company position and story becomes better and better.  \n\nLove the trade and upside here!\n\n(Positions: Long calls and shares)",
      "score": 33,
      "upvote_ratio": 0.87,
      "created_utc": 1740161331.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iu5zsq",
      "title": "Sell for a loss or hold? RDDT Calls",
      "selftext": "Bought some July $200 calls when it dropped on earnings and doubled down already. Average cost of $33.40 for 20 July 18 $200 calls. Currently down about $27k (40%). Should I sell for a loss and salvage about 40k or hold?  ",
      "score": 2,
      "upvote_ratio": 0.56,
      "created_utc": 1740077266.0,
      "mention_location": "selftext"
    }
  ],
  "comments": [
    {
      "comment_id": "me24uvk",
      "post_id": "1iv1ju0",
      "post_title": "AMD turned me into a gambling addict",
      "comment_body": "Bruh if you’re going to do options on this shit stock at least be on the sell side. I bought near the top last year around 200, and after months of DCA and selling calls against my shares, my adjusted cost basis (factoring in collected premium) is about 129. Stop buying options to try to recover this.",
      "score": 4,
      "created_utc": 1740172706.0
    },
    {
      "comment_id": "me4drb8",
      "post_id": "1iv1ju0",
      "post_title": "AMD turned me into a gambling addict",
      "comment_body": "I'm with u, DCA AMD to lower my cost basis... Advanced Money Destroyer gonna recover 1 day I believe",
      "score": 1,
      "created_utc": 1740204388.0
    },
    {
      "comment_id": "me0rtd4",
      "post_id": "1iupem5",
      "post_title": "DOJ Investigates Medicare Billing Practices at UnitedHealth",
      "comment_body": "I bet over the course of your life you’ve probably paid more than the cost of the nicu stay to insurance anyways",
      "score": 1,
      "created_utc": 1740158780.0
    },
    {
      "comment_id": "mdyxb0y",
      "post_id": "1iumfsb",
      "post_title": "RDDT loss porn - I can’t stop buying.",
      "comment_body": "With that average cost clearly your issue is you couldn’t START buying.",
      "score": 56,
      "created_utc": 1740136125.0
    },
    {
      "comment_id": "me0ag3c",
      "post_id": "1iumfsb",
      "post_title": "RDDT loss porn - I can’t stop buying.",
      "comment_body": "I've got 200 shares at 195 average cost... hope this works out for both our sakes, and probably 90% of the people reading your post.",
      "score": 3,
      "created_utc": 1740153932.0
    },
    {
      "comment_id": "mdzmuck",
      "post_id": "1iumfsb",
      "post_title": "RDDT loss porn - I can’t stop buying.",
      "comment_body": "Avg cost of $195? Buy high, sell low!",
      "score": 1,
      "created_utc": 1740146788.0
    },
    {
      "comment_id": "me02gk1",
      "post_id": "1iumfsb",
      "post_title": "RDDT loss porn - I can’t stop buying.",
      "comment_body": "my cost basis is like 140 lol",
      "score": 3,
      "created_utc": 1740151656.0
    },
    {
      "comment_id": "me0jgcs",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "It's a shame Toyota is not (even) bigger. Despite their offshoring and cost cutting they still seem miles better than what American companies produce, certainly from a technical lifespan and reliability. ",
      "score": 2,
      "created_utc": 1740156464.0
    },
    {
      "comment_id": "mdukiju",
      "post_id": "1iu412h",
      "post_title": "Got an extra salary in 7 minutes (Thank you $PLTR)",
      "comment_body": "For people that do not understand options trading:\n\nTrade Type: The regard executed a trade involving Put options on Palantir Technologies ($PLTR).\n\nQuantity: Regard traded 1,000 put contracts\n\nStrike Price: The $95 put expiring on February 23, 2025.\n\nInvestment (Cost Basis): The regard paid $0.47 per contract (multiplied by 1000 contracts and then 100 shares per contract). This would total $64,000.\n\nExit Price: The put options were sold at $0.65, which means he gained a small increase per contract.\n\nProfit: The regard made $16,773.42 from the trade in a short span of 7 minutes.\n\nDownside Risk\n\nWhile the upside resulted in a quick profit, the downside risk was substantial:\n\n1. Max Loss (if the trade went wrong)\nSince he was trading put options, the worst-case scenario would be the put contracts losing all value (expiring worthless).\n\nIf Palantir's stock price rose sharply or remained stable, the puts could have lost value rapidly.\nThe full investment of $64,000 could have been lost if the stock moved against them over time.\n\n2. Liquidity and Execution Risk\nWith a large trade (1,000 contracts), any slippage (difference between expected price and execution price) could erode gains or magnify losses.\n\nIf the regard couldn't exit quickly, the position could swing negatively.\n\n3. Theta Decay (Time Decay)\nSince options lose value over time, holding too long would have exposed him to depreciation risks if volatility dropped or if Palantir's stock price did not move in favor of the put position.\n\n4. Underlying Stock Risk\nIf $PLTR's stock price rose instead of falling, the put option would decline in value, leading to a loss.\n\n\nKey Takeaways\n1. The regard risked $64,000 for a $16,773 gain in 7 minutes.\n2. The max downside was potentially losing all $64,000 if the trade went against them.\n3.The strategy relied on short-term price movement, and the timing of entry/exit was crucial.\n4.If he had mistimed the exit, the profit could have been smaller, or the trade could have turned into a loss.",
      "score": 477,
      "created_utc": 1740077262.0
    }
  ],
  "statistics": {
    "total_mentions": 11,
    "total_upvotes": 583,
    "post_mentions": 2,
    "comment_mentions": 9
  }
}