{
  "ticker": "VOW.DE",
  "posts": [
    {
      "post_id": "1iuxffd",
      "title": "Rivian (RIVN) Earnings Review - Bullish",
      "selftext": "TLDR: Rivian is a BUY, because it’s cheap  \n\nPost earnings call, Rivian has found gross profit, reducing vehicle production costs by $30k.  \n\nEyeing the R2 release in a year, they’ve sourced 95% of materials for it at half the cost of R1, seeing growing bargaining power in negotiations while realizing opportunities for production efficiencies.\n\nPeople are pumped about the R2 release.  \n\nWith $7B of cash they are guiding towards a <($2B) loss for 2025 -  \n\nleaving $5B of cash + $3.4B more from VW deal, putting them at a future $8.4B in cash alone for capex and expansion.  \n\nWhile the DOE loan might see pressure, they will also create **7500 US MANUFACTURING JOBS in Georgia**.  \n\nKilling manufacturing jobs isn’t really aligned with the current admin goals, even as they talk about ICE vehicles and the need to drill more.  \n\nGuidance for ‘25 was conservatively flat given the environment, however -  \n\nWith Tesla protests happening and a deep fleet of existing owners, the Tesla to Rivian trade-up is happening in force, which will especially add to R2 demand and existing R1 demand.  \n\nBetween R2 revenue at minimum $4.5B in ‘26, R1 sales, VW JV bringing in $2B in revenue (or more, as VW CEO has hinted at), potential further demand from other makers for Rivian tech,  \n\nAll of which doesn’t include EDV sales which just opened in February to other fleets, while they guide lower due to Amazon taking on slightly more orders in '24 and slightly less in '25, this is a unique differentiator that furthers the upside.\n\nRivian not only has a strong path to profitability, but likely future SPY inclusion as it reaches scale and profitability.  \n\nRivian is well capitalized, backed by big players who believe in their position, and most importantly -  \n\nPEOPLE LOVE THEIR PRODUCT.  \n\nIn the last year, Rivian is down 15%, while the company position and story becomes better and better.  \n\nLove the trade and upside here!\n\n(Positions: Long calls and shares)",
      "score": 33,
      "upvote_ratio": 0.87,
      "created_utc": 1740161331.0,
      "mention_location": "selftext"
    }
  ],
  "comments": [
    {
      "comment_id": "me2si03",
      "post_id": "1iuvlr8",
      "post_title": "Rivian $6.6B Loan from DOE Will Likely Be Cut",
      "comment_body": "They literally just said in their earnings call yesterday that they are gross margin profitable and no longer lose any money per vehicle. They also said the loan is approved and in progress of being funded. They also have already started receiving the $5B from VW. Your numbers are entirely incorrect.",
      "score": 16,
      "created_utc": 1740179722.0
    },
    {
      "comment_id": "me2kfn5",
      "post_id": "1iuvlr8",
      "post_title": "Rivian $6.6B Loan from DOE Will Likely Be Cut",
      "comment_body": "Because i bought them a couple years ago. They havent shown it in those years. Im still holding hoping they pull their shit together. If and ehrn I need the remaining $$$ ill sell and take the loss. Its the game we play. But the reviews on their vehicles seem to be pretty damn good for the most part except for parts and maintenance. I also own Tesla stock.\n\nIn those years of owning stocks of 2 EV companies, customer demand has not been what the companies and market were thinking theyd be. Theres a reason\nFord\nGM\nHonda\nMB\nToyota\nVW\nVolvo\n\nHave scaled back production targets or POSTPONED building EV’s.",
      "score": -3,
      "created_utc": 1740177220.0
    },
    {
      "comment_id": "mdykf1x",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "Ohh are FIAT and VW gunna get in on that action too?",
      "score": 4,
      "created_utc": 1740128571.0
    },
    {
      "comment_id": "mdyxhat",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "Very correct and Tesla will be at the finish line. American brands are dying and vw is in trouble",
      "score": -9,
      "created_utc": 1740136221.0
    }
  ],
  "statistics": {
    "total_mentions": 5,
    "total_upvotes": 41,
    "post_mentions": 1,
    "comment_mentions": 4
  }
}