{
  "ticker": "WMT",
  "posts": [],
  "comments": [
    {
      "comment_id": "me40x19",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "It's not tariff fears this time. \n\nWMT lowered guidance, predicting weak sales for 2025, and that is killing retail and advertising. Meanwhile, a new COVID virus was discovered by the Wuhan lab, so healthcare stocks are benefitting.",
      "score": 13,
      "created_utc": 1740198567.0
    },
    {
      "comment_id": "me4fxyh",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "I'm in GOOGL and WMT, so we're kind of in the same boat",
      "score": 1,
      "created_utc": 1740205505.0
    },
    {
      "comment_id": "me3ux57",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Just admit you missed the boat lmao. We are at the tail end of the biggest bull market in history, and you think it’s going to go up even more because “low rates = stocks go up.” Every company from AMD and AMZN to XYZ and WMT is giving poor guidance because consumers don’t have any more spending money, and yet the dip is still being bought because regards have been conditioned to do so over the last couple years. Lowering rates and cutting government spending means stagflation — we will see how much the market likes that!",
      "score": 6,
      "created_utc": 1740196111.0
    },
    {
      "comment_id": "me24l5k",
      "post_id": "1iuy180",
      "post_title": "6 months of trading +107k 💰",
      "comment_body": "That's what I struggle with. Had potential multi baggers on SPY three days in a row now that I made no money on because I adjusted my stops to break even. \n\nBought WMT on the dip yesterday and now down 50%. Don't want to cut it since it still has a month to expiration.",
      "score": 1,
      "created_utc": 1740172629.0
    }
  ],
  "statistics": {
    "total_mentions": 4,
    "total_upvotes": 21,
    "post_mentions": 0,
    "comment_mentions": 4
  }
}