{
  "ticker": "GOOGL",
  "posts": [
    {
      "post_id": "1iv4q30",
      "title": "DD Droneshield: tendies are printing and WSB is not even joining the party?!",
      "selftext": "Hello Regards,\n\nDroneshield (DRO) is showing promising returns and WSB seems unaware. A quick search on google trends would make it seem that the USA are not aware of the stock at the moment. So here is a small DD to get this beauty of a company on your radar and not leave all the tendies to the Germans and Australians. \n\n  \nPlain and simple:\n\nDRO develops and sells anti-drone tech. DRO engineers, produces and maintains their own products. \n\nCostumers: EU countries that are ramping up their drone defense systems since Ukraine has demonstrated the dangers of drones. Countries neighboring China since they also can't keep their drones to themselves. South American countries that are trying to counter the use of drones by the drug cartels.\n\nAdded value: Their products protect and save lives.\n\n[Their revenue is ramping up with repeat orders by satisfied customers.](https://preview.redd.it/zp0bc0imhkke1.png?width=1058&format=png&auto=webp&s=bc4cd9e2d400ab64f4fdeee2bcf84c4b8293e514)\n\n.\n\n[They manage to maintain super healthy gross profit margins.](https://preview.redd.it/oy2dheyyhkke1.png?width=1068&format=png&auto=webp&s=dfcdc462de4e6c547a8c3325948efb6256ba61bd)\n\n.\n\n[Net profit margin transitioned into the green. ](https://preview.redd.it/hrvdph1qikke1.png?width=1057&format=png&auto=webp&s=596bfe90e67ba299511afd52132c499501c31797)\n\nWhy is the net profit margin relatively low: 200 of their 255 employees are engineers that R&D this company to perfection. My guess is that this is quite expensive. Droneshield understands: great value comes from great products. And great products bring in great costumers.\n\n  \nHere is a page out of their latest earnings report. This update caused the reverse of the trend. It shows that their revenue spike was not a one off event but only the beginning of the profitable era. Read the full report here: [https://static1.squarespace.com/static/660a32624c94dd36e509baf3/t/67995f878b0b2b6c9b290038/1738104717089/4C\\_4Q24.pdf](https://static1.squarespace.com/static/660a32624c94dd36e509baf3/t/67995f878b0b2b6c9b290038/1738104717089/4C_4Q24.pdf)\n\nhttps://preview.redd.it/7ow29x92okke1.png?width=633&format=png&auto=webp&s=26bcc8aedaa65b0100d586dfea9b91a4bdcb543b\n\nNegative: DRO takes on very little debt, to little. Instead they have gradually over the years sold more shares. I would say this should slow down now cash is coming in through sales. \n\n  \nFurthermore they maintain a very healthy balance sheet with 220 million cash balance. Check out their website. Its a piece of art on its own: [https://www.droneshield.com/investor-relations](https://www.droneshield.com/investor-relations)\n\n  \nMy humble position:\n\nhttps://preview.redd.it/ikyzvcrqfkke1.png?width=1534&format=png&auto=webp&s=565d7e0a27412ff805ca54df26f64635d2263423\n\nI plan to stay in for the long run. But if it moons again like last time I will take profit and step back in when the dust settled. \n\nThere is a lot more to be said about this company. But I leave that for the discussion. I hope I have been of service to my fellow regards at WSB.\n\nDisclaimer: I am not a financial advisor. No AI was used making this DD. The first 3 graphs are not fully up to date with the latest earnings report.",
      "score": 13,
      "upvote_ratio": 0.71,
      "created_utc": 1740179716.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iv0u3b",
      "title": "In Nancy and Bezo I trust",
      "selftext": "Bought AMZN and GOOGL leap last week, decided to double down today after the drop. I aint leaving until these turn 10 baggers.\n\nMy DD: trust in Nancy, and bezo because he refunded my lost gift card purchases.\n\nhttps://preview.redd.it/yqrxgwlzyjke1.png?width=872&format=png&auto=webp&s=6a392d8b612e994d01c4272fafc5d047bf86978c\n\nhttps://preview.redd.it/zt7e5vlzyjke1.png?width=856&format=png&auto=webp&s=a4cab9a225f9f3f6aefde32c9e7d35edc00690aa\n\n",
      "score": 133,
      "upvote_ratio": 0.86,
      "created_utc": 1740169810.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iuxgtn",
      "title": "Jensen Falldom For Next Week Earning",
      "selftext": "TLDR: I suck in trading, reverse me and buy Nvidia calls for free money.\n\nOkay okay, I have just got a -98% decrease in my XP puts, but hey I just asked my wife's boyfriend for a little bit more money and some Wendy's payout. Let's start how this NVIDIA will fall.\n\nCurrent situation:\n\n* Jensen's kingdom got kicked out of 140 club, and back to 139 (at the time I write this shit DD), P/E 55.14 (compared to 55.96 for Industrial average) and will have another earning call next week. \n* President Trump are planning to tax 25% tariff on chips outside of US, a bubble for Nvidia manufacturing\n* Yes yes I know 5000 series releases got sold out in seconds, but it was released on Jan 30, so it's next quarter so it doesn't do shit this quarter yet.\n\nWhy you should buy put?\n\n* Insider trading shows that there is a massive sell off, obviously it doesn't say anything much.\n\n[Insider Trading](https://preview.redd.it/t4w62gqc2jke1.png?width=1038&format=png&auto=webp&s=ad922a3c0eb97ce48039d912bb1cc677eeff5db9)\n\n* Nvidia tends to sensitive to news, especially world new and fluctuated the most when it comes to news.\n* Nvidia main manufacturing is TSMC, which got unlove for our beloved President Trump (https://www.mk.co.kr/en/business/11243062)\n* China (in general) wants to compete with chip manufacturing especially with Taiwan (https://www.taipeitimes.com/News/biz/archives/2025/02/11/2003831653)\n* Recently, Google and Microsoft starts to develop their own chips for their AI, so we are heading to era of independent chip-dependent from Nvidia\n* Sure sure, \"yOu sTill nEEd to bUy nVidIa Chips\".From previous earnings, there is a 17% increase in Data Center revenue Q4 2024, a 16% increase in Data Center revenue Q3 2024, and 23% increase in Data Center revenue Q2 2024, and 27% increase in Q1 2024. There is a slow down increase and with a nearest quantum chips release from IQVN, Google, Microsoft, I anticipate that this quarter can still have an increase but not impressive\n* So why I think Nvidia chips are stagnant? The investment of research from their previous earnings clearly shows that they don't want to heavily invest in research as much as before --> Chips independent era gonna be coming.\n\nWhy you should buy calls?\n\n* Because I buy puts\n\nPosition:\n\n[Position](https://preview.redd.it/5yp493fq8jke1.png?width=1372&format=png&auto=webp&s=042b36e8d27ba302fbd34fa70c73ee90ef1e3462)\n\nI buy on August because there are around 150k investment in the same investment and hey I am regarded.   \n  \nI eat crayon to make this dd so NFA but hey I'm gey bear.   \n  \n",
      "score": 0,
      "upvote_ratio": 0.42,
      "created_utc": 1740161428.0,
      "mention_location": "selftext"
    }
  ],
  "comments": [
    {
      "comment_id": "me6fe06",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "Brother your expirations are long. \nPart of options is having the balls to watch trades in the red. \nThe alternative is knowing the exact entry point every time - which is near impossible. \nThe only one I’m concerned about it PLTR, I wouldn’t buy calls on such an over valued company. \n\nHole on tight and DCA your Google  and Amazon positions you will come out on top",
      "score": 39,
      "created_utc": 1740238541.0
    },
    {
      "comment_id": "me6fnj4",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "Love the Google play. Just give it time man.",
      "score": 2,
      "created_utc": 1740238621.0
    },
    {
      "comment_id": "me7beiq",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "I’m a big fan of “if you’re going to do options do longer dated options”\n\nThat being said if you don’t have the stomach to watch your options be down when they still have a year left on them you probably shouldn’t be doing them\n\nI would imagine your break evens for say the Google ones are like 220+\n\nYou probably need to get close to there by October November at the latest for them to be worth anything (I’m too lazy to look at an options calculator or figure out your original strike price but you can do it yourself)\n\nI would at least wait til like may before I would bail from these longer dated ones, unless you truly believe this is the end of the bull run",
      "score": 2,
      "created_utc": 1740247780.0
    },
    {
      "comment_id": "me3fyrn",
      "post_id": "1iv7pic",
      "post_title": "Alibaba and the 23 thieves",
      "comment_body": "Amzn and googl is a good add at this level",
      "score": 11,
      "created_utc": 1740190565.0
    },
    {
      "comment_id": "me3lppt",
      "post_id": "1iv6zxy",
      "post_title": "Dow drops 700 points for worst day of 2025 so far on new fears on Trump Tarriffs",
      "comment_body": "Dow is price weighted, not cap weighted.\n\nSo it is heavily weighted towards United health, which coincidentally has allegations of screwing the US government out of billions with phony diseases.  Which hits two items on the Trump bingo card. Waste, fraud, and abuse and inflating medical diseases to make the president look bad.\n\nAdditionally,  Google which is a large component of both S&P and Dow index, had a story about being charged with violating the EU Digital Markets Act.  That could result in heavy fines that could take a few percentage points of yearly profits.",
      "score": 3,
      "created_utc": 1740192659.0
    },
    {
      "comment_id": "me2j3tb",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Did the same holding  $GOOGL 190c 12/19/25 hope they print",
      "score": 8,
      "created_utc": 1740176822.0
    },
    {
      "comment_id": "me4fxyh",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "I'm in GOOGL and WMT, so we're kind of in the same boat",
      "score": 1,
      "created_utc": 1740205505.0
    },
    {
      "comment_id": "me35k5u",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Guh, i don’t swing weeklies on amzn or googl. Nvda or tsla, or even meta, probably tho",
      "score": 4,
      "created_utc": 1740184044.0
    },
    {
      "comment_id": "me35r6y",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Yours is long enough that you would print too for sure. Worst case is breakeven, we aint losing money on GOOGL",
      "score": 7,
      "created_utc": 1740184108.0
    },
    {
      "comment_id": "me48xai",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "For shorter call on GOOGL, my TP is around 190-195 which hopefully googl can recover by next month. I will hold the leap until GOOGL goes to at least 220-230. AMZN TP is 240",
      "score": 2,
      "created_utc": 1740202054.0
    },
    {
      "comment_id": "me0641h",
      "post_id": "1iuprio",
      "post_title": "$DBX Guidance Flop: Still holding",
      "comment_body": "Yeah not sure who uses Dropbox anymore. \n\nOneDrive comes out of the box for Windows users.\n\nGoogle drive also incentives its customer   through Android (Gmail,  Photo) . And apple users have iCloud \n\nMe personally I have Google Drive with 2T plan  and One Drive default. Not sure why I ever download and use Dropbox. It was popular when it first came out as it was the first cloud storage. \n\nNot to mention the whole corporate space using One Drive and windows ecosystem.\n\nOne drives only space (huh) or niche they capture is media sharing as it supports large files.\n\nDon't have cash at hand and might port some positions. This can go down to 10  by eoy",
      "score": 3,
      "created_utc": 1740152702.0
    },
    {
      "comment_id": "me0y6zh",
      "post_id": "1iumfsb",
      "post_title": "RDDT loss porn - I can’t stop buying.",
      "comment_body": "I feel like it's moreso the reason behind why they missed user numbers. Their DAU is way too dependent on Google search rn, and for the same reason Google's stock is down big money might be concerned AI agents will lower traffic to reddit. Your average person might also stop coming to reddit if they can get the same answers but through an AI agent. Just my guess though but this drop is making me question holding",
      "score": 3,
      "created_utc": 1740160529.0
    },
    {
      "comment_id": "mdwqtw5",
      "post_id": "1iu5zsq",
      "post_title": "Sell for a loss or hold? RDDT Calls",
      "comment_body": "I haven't purchased something through an Ad anywhere, ever. Yet you have billions being spent on marketing and companies like META and Google earning their valuations through ad revenue. So this point isn't valid IMO",
      "score": 5,
      "created_utc": 1740101054.0
    }
  ],
  "statistics": {
    "total_mentions": 16,
    "total_upvotes": 236,
    "post_mentions": 3,
    "comment_mentions": 13
  }
}