{
  "ticker": "LOW",
  "posts": [
    {
      "post_id": "1iv4q30",
      "title": "DD Droneshield: tendies are printing and WSB is not even joining the party?!",
      "selftext": "Hello Regards,\n\nDroneshield (DRO) is showing promising returns and WSB seems unaware. A quick search on google trends would make it seem that the USA are not aware of the stock at the moment. So here is a small DD to get this beauty of a company on your radar and not leave all the tendies to the Germans and Australians. \n\n  \nPlain and simple:\n\nDRO develops and sells anti-drone tech. DRO engineers, produces and maintains their own products. \n\nCostumers: EU countries that are ramping up their drone defense systems since Ukraine has demonstrated the dangers of drones. Countries neighboring China since they also can't keep their drones to themselves. South American countries that are trying to counter the use of drones by the drug cartels.\n\nAdded value: Their products protect and save lives.\n\n[Their revenue is ramping up with repeat orders by satisfied customers.](https://preview.redd.it/zp0bc0imhkke1.png?width=1058&format=png&auto=webp&s=bc4cd9e2d400ab64f4fdeee2bcf84c4b8293e514)\n\n.\n\n[They manage to maintain super healthy gross profit margins.](https://preview.redd.it/oy2dheyyhkke1.png?width=1068&format=png&auto=webp&s=dfcdc462de4e6c547a8c3325948efb6256ba61bd)\n\n.\n\n[Net profit margin transitioned into the green. ](https://preview.redd.it/hrvdph1qikke1.png?width=1057&format=png&auto=webp&s=596bfe90e67ba299511afd52132c499501c31797)\n\nWhy is the net profit margin relatively low: 200 of their 255 employees are engineers that R&D this company to perfection. My guess is that this is quite expensive. Droneshield understands: great value comes from great products. And great products bring in great costumers.\n\n  \nHere is a page out of their latest earnings report. This update caused the reverse of the trend. It shows that their revenue spike was not a one off event but only the beginning of the profitable era. Read the full report here: [https://static1.squarespace.com/static/660a32624c94dd36e509baf3/t/67995f878b0b2b6c9b290038/1738104717089/4C\\_4Q24.pdf](https://static1.squarespace.com/static/660a32624c94dd36e509baf3/t/67995f878b0b2b6c9b290038/1738104717089/4C_4Q24.pdf)\n\nhttps://preview.redd.it/7ow29x92okke1.png?width=633&format=png&auto=webp&s=26bcc8aedaa65b0100d586dfea9b91a4bdcb543b\n\nNegative: DRO takes on very little debt, to little. Instead they have gradually over the years sold more shares. I would say this should slow down now cash is coming in through sales. \n\n  \nFurthermore they maintain a very healthy balance sheet with 220 million cash balance. Check out their website. Its a piece of art on its own: [https://www.droneshield.com/investor-relations](https://www.droneshield.com/investor-relations)\n\n  \nMy humble position:\n\nhttps://preview.redd.it/ikyzvcrqfkke1.png?width=1534&format=png&auto=webp&s=565d7e0a27412ff805ca54df26f64635d2263423\n\nI plan to stay in for the long run. But if it moons again like last time I will take profit and step back in when the dust settled. \n\nThere is a lot more to be said about this company. But I leave that for the discussion. I hope I have been of service to my fellow regards at WSB.\n\nDisclaimer: I am not a financial advisor. No AI was used making this DD. The first 3 graphs are not fully up to date with the latest earnings report.",
      "score": 13,
      "upvote_ratio": 0.71,
      "created_utc": 1740179716.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iuykwm",
      "title": "the sector you've never touched IS a 10-bagger, but not like that [DD w/ $250k invested)",
      "selftext": "A few days ago, I saw the[ \\[DD\\]](https://www.reddit.com/r/wallstreetbets/comments/1ir0k5o/this_sector_youve_never_touched_is_a_10bagger_dd/) posted here about the mining industry. The OP of this post was right to point out that the mining sector is due for a massive run and I appreciated the attention they drew to the qualities of a high return opportunity.  However, their recommendation was mostly to invest in mining related to GOLD! Reading that was like watching one set the dining table beautifully, only to proceed to mistake the appetizer for the main dish.\n\nToday I’m going to provide further evidence for the case that the mining industry presents a massive opportunity on a timescale anywhere from right now to the end of Trump’s term. The investments that are going to make you rich, however, have nothing to do with gold, per se, and everything to do with titanium, lithium, rare earth minerals, and the complete market dominance China has over their processing and extraction.\n\n**Part I: Ukraine, Greenland, Russia, Cosmetic Moguls, and the Allied Supply Chain**\n\nWhy does Trump care so much about Greenland? Why is he so insistent on Ukraine signing away 50% of their claim to Ukraine’s minerals and, if that matters so much, why did he cut Ukraine out from the opening negotiations with Russia?\n\nThe answer is that it's all about the supply chain of minerals and metals. China is bending us over the table with their grip over the chain (80-90%+ dominance), especially in separation/processing of the materials. Recently, they [have gone as far as to ban key processing/separation materials needed](https://www.reuters.com/technology/chinese-lithium-company-halts-tech-exports-trade-tensions-build-2025-02-18/), posturing to protect their interests in the face of American policy strides to distance themselves from their grip over the market. They have also kept costs of lithium and other precious earth and minerals artificially low, stymieing western incentive to establish their own supply chain.\n\n[China has been *SO* effective at doing all of this,](https://www.wsj.com/finance/commodities-futures/china-dominant-mineral-mining-global-supply-chain-e2b7840e) that until the last few years, there was **ZERO** mining/processing of rare earth happening domestically in the USA. The picture wasn’t much better for other crucial metals and resources, such as lithium and titanium. We slept too long, took them for granted, and now here we are.\n\nDon’t understand the stakes? [Here is **Marco Rubio**](https://uscriticalmaterials.com/wp-content/uploads/2025/01/Marco-Rubio-video.mp4), our present secretary of state and who has recently opened up peace negotiations with Russia over Ukraine, being an absolute doomer about the state of play with the supply chain. **Lindsey Graham -** another key Trump ally - also has eyes on the issue, especially as it pertains to Ukraine and what they may offer us for security (check out these tweets [here ](https://x.com/LindseyGrahamSC/status/1891046931323040187)and [here](https://x.com/LindseyGrahamSC/status/1799832487285465244)).\n\nLet me be clear that this is a bipartisan issue and it is *extremely* difficult to deny the threat this poses to our national security and economic prosperity (the previous administration came to the same conclusion). That is why it has been a priority of both administrations. However, this present iteration of the Trump administration is uniquely situated to set the market ablaze in ways that previous administrations could not.\n\n**Part II. Convergence, Timing, Trump Administration, Private Equity, Executive Action**\n\nAlright, so we have established that the US is seriously threatened by China’s stranglehold over this sector. What is this administration doing and who are the relevant people involved? I don’t have time to give you all of the reasons that point me in favor of a bullish sentiment on titanium, lithium, and rare earth minerals. Here are a few that I take to be really supportive, however.\n\nFirst, let me introduce you to **Ronald S. Lauder**, heir to the Estée Lauder cosmetics company. For whatever reason, this guy has a real penchant for minerals and mining. He is [*close friends* with Donald Trump](https://www.nytimes.com/2025/02/12/world/europe/trump-ukraine-rare-earth-minerals.html) and is, according to the NY times, the one that initially led Trump to turn his attention to Greenland. He is also very interested in Ukrainian minerals and metals.\n\nYou see, Ronald Lauder is a business partner of **Brian Menell**, CEO of private investment/equity firm [**Techmet**](https://www.techmet.com/), which seeks to expand production of precious minerals across our global assets to help ensure a secure and sustainable supply of the key metals for western-aligned interests.\n\nIf there is one company to look at and one company alone, it is Techmet. Recently, they have secured 180 million from **QIA**. They are **DOE and DFC** contractors with extremely lucrative deals over the last few years. Furthermore, what makes them unusual is that the DFC decided against their usual financing terms and actually went ahead and bought a direct stake in Techmet itself. That means the **US Federal Government** is a stakeholder directly aligned with the interests and priorities of Techmet. \n\nAs if this was not enough, Techmet also has the investment/backing of energy behemoth Mercuria. They also hold advisory members and business partners from big name mining companies like Rio Tinto. Furthermore, their current chairman is **Admiral Mike Mullen** who was previously Chairman of the Joint Chiefs of Staff of the United States, as well as on the board of **General Motors. S**uffice to say that their present reach and influence over western government is compelling as anything I have ever seen before. \n\nIf you are curious, here is the CEO Brian Menell two or so weeks ago discussing the present state of the administration and supply chain issues [here.](https://www.youtube.com/watch?v=sP9_PY5gEug&ab_channel=SmarterMarkets%E2%84%A2) He is bullish about this administration and highlights what needs to happen in order to compete with China effectively. \n\nWhat does he stress? **Permitting, Bureaucracy Reform, Federal Incentivization.** He calls on the administration to lift regulations, give permits quickly, purchase directly and invest in western-aligned companies that are working on the energy transition. Trump is doing *exactly* this, from establishing the sovereign wealth fund, to the guidance issued by way of two executive actions “[Unleashing American Energy”](https://www.whitehouse.gov/presidential-actions/2025/01/unleashing-american-energy/), as well as  [“Unleashing Prosperity through Deregulation](https://www.whitehouse.gov/presidential-actions/2025/01/unleashing-prosperity-through-deregulation/).”\n\nI recommend you read the language, especially Section 9 of the executive order on energy. The order seeks to “establish our position as the leading producer and processor of non-fuel minerals, including rare earth minerals, which will create jobs and prosperity at home, strengthen supply chains for the United States and its allies, and reduce the global influence of malign and adversarial states” as well as “to protect the United States' economic and national security and military preparedness by ensuring that an abundant supply of reliable energy is readily accessible in every State and territory of the Nation”\n\nBy way of the executive orders, federal agencies are instructed (within 60 days) to identify and eliminate barriers to efficient private investment and reduce project timelines for critical energy. Trump also instructs that priority should be placed on making sure USA funds critical mineral ventures and he also instructs to make sure the USA has an adequate stockpile of critical minerals/metals (and to purchase more if not). Emphasis is also placed on geologic mapping, and key western partnerships that share national  security interests, called the **“Quad.”** If you are interested in further reading on this last point, I recommend[ this article ](https://www.orfonline.org/research/the-case-for-a-quad-mineral-security-partnership#_edn81)on Quadrilateral Mineral Partnerships.\n\nHere is another item in the order on Unleashing American Energy:\n\n>(j) Within 60 days of the date of this order, the Secretary of State, Secretary of Commerce, Secretary of Labor, the United States Trade Representative, and the heads of any other relevant agencies, shall submit a report to the Assistant to the President for Economic Policy that includes policy recommendations to enhance the competitiveness of American mining and refining companies in other mineral-wealthy nations.\n\nTrump is not a patient man. He will act quickly after receiving this report in March and he is already trying his best to wrap up Ukraine as quickly as possible too with assurances of mineral access. That's why I believe the shortest timeline to return is now to the end of Trump's term.\n\nFurthermore, I believe that Trump's team began negotiations without Ukraine precisely because they are seeking to get the best minerals deal possible. Russian advances on Ukraine have meant that many of the precious minerals the west is interested in now falls within Russian-occupied territory in Ukraine. Having 50% of the rights to Ukraine's rare earth is not all that great, given this reality**. There is no guarantee that Ukraine will win the war (or when), nor is there a guarantee they will ever regain the territory.** Meanwhile, the US would presumably continue to pump money into Ukraine with no end in sight? Trump isn't going to be OK with that. I think he is working out a post-war deal with Russia that makes certain that minerals will be available immediately.\n\n**Part III: Positions**\n\nWhere to invest? Well, Techmet is private. However, there are still plays that can be made in this sector. Right now I have \\~$250,000 in derivatives and stock opened yesterday and today. Here is where I am at the moment, though I will absolutely re-balance as I continue to do research.\n\nhttps://preview.redd.it/oclseac8cjke1.jpg?width=665&format=pjpg&auto=webp&s=48232bf2a19ed448757da6cc248dee2453ae6faa\n\nhttps://preview.redd.it/nznu3bc8cjke1.jpg?width=690&format=pjpg&auto=webp&s=22a30e2408d70fb47c95264a4a8137c11402d7d1\n\nhttps://preview.redd.it/am8i3ac8cjke1.jpg?width=671&format=pjpg&auto=webp&s=2ca74d99bd71812608bbe3a7bcbe1c4779e5c156\n\nWhy did I pick these? (don't mind Humana or Uber)\n\n>**MP materials** is presently the only rare earth mine and processor in the United States.\n\n>**LYS** is AU but part of \"The Quad\" that Trump opens the door for investments towards when he writes \"(k) The Secretary of State shall consider opportunities to advance the mining and processing of minerals within the United States through the Quadrilateral Security Dialogue.\"\n\n>**REEMF** is self-explanatory, rare earth exploration\n\n>**CAT**  is at a 6 month low. I thought that this was a good time to get in given ramping of mining in future. They have ties to Ukraine's post-war rebuilding via the U.S.-Ukraine Business Council (USUBC).\n\n>**TSLA** (not pictured; getting calls Monday) as Elon Musk is close with Trump and shares concern over lithium in particular. TSLA has [just launched operations in a lithium processing plant in TX as well](https://cen.acs.org/energy/energy-storage-/Tesla-begins-making-lithium-chemicals/102/web/2024/12#:~:text=Credit:%20Tesla,lithium%20production%20in%20the%20US) and I would not be surprised to see substantial federal funding in the short term and medium term. See [also this article.](https://www.nasdaq.com/articles/where-does-tesla-get-its-lithium)\n\n>**UUUU** is largely uranium although they are branching out. I'm bullish on it because of this language: \"(c)  The Secretary of the Interior shall instruct the Director of the U.S. Geological Survey to consider updating the Survey’s list of critical minerals, including for the potential of including uranium.\"\n\n>**IPX** up-and-coming titanium processing w/ a special patent.\n\n>**Other ideas:** Talon Metals (nickel, partnered with TSLA);  ABAT, Holtec, anything having to do with Brazilian Nickel or General Atomics; anything related to the Quad countries and rare earth / metals. I would welcome other suggestions regarding investments that get the right kind of exposure.\n\nI'll close with this. Brian Menell, after meeting Mr. Zelensky in NY alongside other energy executives in September, had this to say in a statement:\n\n>“TechMet, together with our partners, is available to move forward with further work if the U.S. and Ukrainian governments instruct us to do so\"\n\nWestern interests will be ready at a moments notice. Will you be?",
      "score": 490,
      "upvote_ratio": 0.92,
      "created_utc": 1740164147.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iuxz7j",
      "title": "Just doubled down on NVDA earnings with NVDL call options, relatively low risk but hopefully will payoff.",
      "selftext": "Here is short term play on NVDA earnings. Just a hunch, Hopefully theta won’t hunt me down before the earning are fully digested and priced in.",
      "score": 32,
      "upvote_ratio": 0.88,
      "created_utc": 1740162687.0,
      "mention_location": "title"
    },
    {
      "post_id": "1iuhlv3",
      "title": "BKSY BlackSky, the Most Interesting Space Stock You Haven't Heard Of",
      "selftext": "BlackSky owns a constellation of satellites that produce near real-time high-resolution imagery. Yesterday they successfully put the first of Gen-3 satellites into orbit with the help of Rocket Lab.\n\n[https://www.rocketlabusa.com/updates/rocket-lab-successfully-launches-60th-electron-first-of-multiple-missions-for-blacksky/](https://www.rocketlabusa.com/updates/rocket-lab-successfully-launches-60th-electron-first-of-multiple-missions-for-blacksky/)\n\nThe Gen-3 boasts an impressive step up vs Gen-2. Including:\n\n\\- 30 min delivery  \n\\- 35 cm resolution  \n\\- performant in low light\n\nhttps://preview.redd.it/zv45212lteke1.png?width=1256&format=png&auto=webp&s=72c588781a689debbdda90cade1d25f740b7298a\n\nWhat impresses me about the company is that have an absolutely ridiculous cadence of contracts announcements. We are talking new contracts week after week after week.\n\nhttps://preview.redd.it/srlxn6g8weke1.png?width=626&format=png&auto=webp&s=396635b4408c866ab77a3571771e993c9db90b14\n\nThis has resulted produced a smooth as butter compounding machine that has recently inflected to positive ebidtda.\n\nhttps://preview.redd.it/49f0wdblweke1.png?width=580&format=png&auto=webp&s=6bba22e008adc454b1a6bc6f9731ede73b71897b\n\nAs far as valuation goes, it stacks of pretty damn nice. For example, far better grow and lower ev / sales multiple compared to it's closest peer PL.\n\nhttps://preview.redd.it/o0wzghh2xeke1.png?width=424&format=png&auto=webp&s=aa27eef224ebe52a3ac67bfde8c6bf4e03384765\n\nBack in the day they had a strategic partnership with PLTR. Not notably sure if it is still ongoing: \n\n[https://www.blacksky.com/blacksky-secures-investment-from-palantir-and-enters-into-multi-year-strategic-partnership-following-successful-pilot-project/](https://www.blacksky.com/blacksky-secures-investment-from-palantir-and-enters-into-multi-year-strategic-partnership-following-successful-pilot-project/)\n\n  \nIn sum, I think BKSY occupies a really interesting niche (high res, low latency imagery) that will likely be able to command really nice margins over time. And they have the benefit of a good liquidity and positive growth, so probably don't need to worry about being hammered by financing - as is the typical case with satellite companies - all that much.\n\nI am rolling with a good slug of commons, and some calls for extra juice.\n\nhttps://preview.redd.it/llssghcjxeke1.png?width=660&format=png&auto=webp&s=62ab5baedaff593425123cb81df6e6a7e161311b\n\nhttps://preview.redd.it/sgxu3qrmxeke1.png?width=339&format=png&auto=webp&s=75a23bf587474d8ab210950f7d804fb998764bee\n\n",
      "score": 151,
      "upvote_ratio": 0.84,
      "created_utc": 1740109349.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iuaf06",
      "title": "Thanks Trump and Karp for finally crashing pltr.",
      "selftext": "Wish I hadn't been a p...sy and sold out the 10 for 65 cents... only turned into $1300 or $1900 each had I held to the low today.  ",
      "score": 16,
      "upvote_ratio": 0.62,
      "created_utc": 1740088176.0,
      "mention_location": "selftext"
    }
  ],
  "comments": [
    {
      "comment_id": "me2shzb",
      "post_id": "1iv4q30",
      "post_title": "DD Droneshield: tendies are printing and WSB is not even joining the party?!",
      "comment_body": "# **TLDR**\n\n---\n\n**Ticker:** DRO (Droneshield)\n\n**Direction:** Up\n\n**Prognosis:**  Long-term hold, potential for short-term gains if it moons.\n\n**Company:** Makes anti-drone tech, seeing increased revenue due to global demand (Ukraine, China, drug cartels).\n\n**Financials:** Healthy gross profit margins, recently transitioned to net profit, substantial cash on hand.  Revenue is spiking and showing strong future orders.\n\n**Risk:**  Relatively low debt, but has historically diluted shares.\n\n**Author's Position:** Long-term hold, but will take profits if it moons, then buy the dip.\n\n**WSB Relevance:**  OP thinks WSB is sleeping on this one.  Get in before the Germans and Aussies buy it all up.",
      "score": 1,
      "created_utc": 1740179721.0
    },
    {
      "comment_id": "me3ux57",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Just admit you missed the boat lmao. We are at the tail end of the biggest bull market in history, and you think it’s going to go up even more because “low rates = stocks go up.” Every company from AMD and AMZN to XYZ and WMT is giving poor guidance because consumers don’t have any more spending money, and yet the dip is still being bought because regards have been conditioned to do so over the last couple years. Lowering rates and cutting government spending means stagflation — we will see how much the market likes that!",
      "score": 6,
      "created_utc": 1740196111.0
    },
    {
      "comment_id": "me1ez1x",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "How are you possibly upset by any of this. The low was 118ish and it's already way above that.",
      "score": 5,
      "created_utc": 1740165204.0
    },
    {
      "comment_id": "me23hpm",
      "post_id": "1iuy180",
      "post_title": "6 months of trading +107k 💰",
      "comment_body": "I try to be disciplined and have targets I trim at. I always try to leave a few runners. I'm watching price action all day so if I see it start to turn I'll sell.\n\nA majority of my trades are position trades. I occasionally do low expiry contracts and get very lucky. Always a risk reward calculation though.\n\nAs for if this is sustainable, I do expect some regression back to the mean. I try to be very careful with bankroll management so one trade doesn't blow me out.\n\nKnowing when to take a loss is as important as knowing when to take a win.",
      "score": 1,
      "created_utc": 1740172317.0
    },
    {
      "comment_id": "me24bc2",
      "post_id": "1iuxz7j",
      "post_title": "Just doubled down on NVDA earnings with NVDL call options, relatively low risk but hopefully will payoff.",
      "comment_body": "NVDA calls in a tech bubble that might pop any minute is by no means \"low risk\"",
      "score": 10,
      "created_utc": 1740172552.0
    },
    {
      "comment_id": "me2acy4",
      "post_id": "1iuxz7j",
      "post_title": "Just doubled down on NVDA earnings with NVDL call options, relatively low risk but hopefully will payoff.",
      "comment_body": "I agree with your statement, what I meant was me losing the call premium is low risk investment. If it goes to zero,  it does not hurt too bad.",
      "score": 3,
      "created_utc": 1740174262.0
    },
    {
      "comment_id": "mdzmuck",
      "post_id": "1iumfsb",
      "post_title": "RDDT loss porn - I can’t stop buying.",
      "comment_body": "Avg cost of $195? Buy high, sell low!",
      "score": 1,
      "created_utc": 1740146788.0
    },
    {
      "comment_id": "mdxs5e6",
      "post_id": "1iuhlv3",
      "post_title": "BKSY BlackSky, the Most Interesting Space Stock You Haven't Heard Of",
      "comment_body": "At the lows, the valuations were just ridiculously too low. A lot of small and mid caps were in the same spot mid-last year and had similar recoveries.",
      "score": 0,
      "created_utc": 1740113958.0
    },
    {
      "comment_id": "mdxt096",
      "post_id": "1iuhlv3",
      "post_title": "BKSY BlackSky, the Most Interesting Space Stock You Haven't Heard Of",
      "comment_body": "It was too low before it was pushed down for the RS.",
      "score": 2,
      "created_utc": 1740114304.0
    },
    {
      "comment_id": "me060a0",
      "post_id": "1iucp16",
      "post_title": "NVDA yolo",
      "comment_body": "Yes, I know. NVDA was also red 11/13 to 11/18. Maybe MMs want to drive the stock down so they can get a better price in the lead up to earnings, getting paper handers to sell at the low before earnings, and regards to buy at the high and hold them bags after.\n\nNot saying it will happen this time, I ain't playing NVDA on a Friday, but I can see where OP is going. We here to make money, long or short - it's good to be open minded.",
      "score": 2,
      "created_utc": 1740152673.0
    },
    {
      "comment_id": "mdwj4cb",
      "post_id": "1iub8fm",
      "post_title": "All IN CELH M23",
      "comment_body": "Did you look at the pictures? The low on the account was 18k",
      "score": 22,
      "created_utc": 1740097787.0
    },
    {
      "comment_id": "mdxc4dh",
      "post_id": "1iu8z2i",
      "post_title": "5000 shares in INTC",
      "comment_body": "Buy high sell low",
      "score": 1,
      "created_utc": 1740108096.0
    },
    {
      "comment_id": "mdx3noy",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "u/Advanced-Ad-9186 Right before close, I read your post and thought fk it, and bought 50 $28 expiring on the 28th.\n\nAs of now, looking profitable. But we shall see. Either way, thanks, buddy!\n\nEdit: How low do you think it can go?",
      "score": 5,
      "created_utc": 1740105267.0
    },
    {
      "comment_id": "mdvieil",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "So glad I got next week and the week after puts. IV was low low. Looks like it’s going the right direction for a company that isn’t growing (hopefully it keeps trending).",
      "score": 3,
      "created_utc": 1740086610.0
    },
    {
      "comment_id": "mdurd7q",
      "post_id": "1iu5ybi",
      "post_title": "$PLTR will do a 10%+ nosedive tomorrow opening.",
      "comment_body": "Based on the current price action and technical levels:\n\t1.\tCurrent Price: ~$104.64\n\t2.\tKey Support Levels: $100, $85, $66\n\t3.\tBearish Momentum: RSI divergence, bearish engulfing pattern\n\nEntry Considerations for a Put Option (Exp. 2/21/25):\n\t•\tAggressive Entry: Around $104–$105, anticipating a break below $100 soon.\n\t•\tConservative Entry: If PLTR rebounds to ~$110 (previous resistance), enter a put anticipating a rejection.\n\t•\tSafer Confirmation: Enter if PLTR closes below $100 with volume, targeting $85 as the next major support.\n\nPrice Targets for Put Option:\n\t•\tShort-Term: $95 (recent intraday low)\n\t•\tMedium-Term: $85 (next major support)\n\t•\tLonger-Term: $66 (if significant weakness continues)\n\nIf you expect a continued downtrend due to macro factors (defense cuts, CEO share sale, overbought conditions), an entry around $104–$110 could work, with a target of $85–$95. If $100 holds as support, it may be better to wait or adjust strategy.",
      "score": 4,
      "created_utc": 1740079137.0
    },
    {
      "comment_id": "mdut7fe",
      "post_id": "1iu5ybi",
      "post_title": "$PLTR will do a 10%+ nosedive tomorrow opening.",
      "comment_body": "Wsb regards are #1 at buy high sell low. Buying puts after a major drop is like buying calls after a big run up.",
      "score": 2,
      "created_utc": 1740079636.0
    },
    {
      "comment_id": "mdumve5",
      "post_id": "1iu412h",
      "post_title": "Got an extra salary in 7 minutes (Thank you $PLTR)",
      "comment_body": "either salary is really high or really low or you don't have balls. no respect!",
      "score": 1,
      "created_utc": 1740077900.0
    }
  ],
  "statistics": {
    "total_mentions": 22,
    "total_upvotes": 771,
    "post_mentions": 5,
    "comment_mentions": 17
  }
}