{
  "ticker": "TM",
  "posts": [],
  "comments": [
    {
      "comment_id": "me2kfn5",
      "post_id": "1iuvlr8",
      "post_title": "Rivian $6.6B Loan from DOE Will Likely Be Cut",
      "comment_body": "Because i bought them a couple years ago. They havent shown it in those years. Im still holding hoping they pull their shit together. If and ehrn I need the remaining $$$ ill sell and take the loss. Its the game we play. But the reviews on their vehicles seem to be pretty damn good for the most part except for parts and maintenance. I also own Tesla stock.\n\nIn those years of owning stocks of 2 EV companies, customer demand has not been what the companies and market were thinking theyd be. Theres a reason\nFord\nGM\nHonda\nMB\nToyota\nVW\nVolvo\n\nHave scaled back production targets or POSTPONED building EV’s.",
      "score": -3,
      "created_utc": 1740177220.0
    },
    {
      "comment_id": "me0jgcs",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "It's a shame Toyota is not (even) bigger. Despite their offshoring and cost cutting they still seem miles better than what American companies produce, certainly from a technical lifespan and reliability. ",
      "score": 2,
      "created_utc": 1740156464.0
    },
    {
      "comment_id": "me0z6tc",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "Toyota is pretty good, but even then they're not immune. There was that whole debacle with GR Corollas catching on fire and GR86s grenading engines, then Toyota refusing to warranty either if the owner had even considered going to a track (as advertised).\n\n\nStill, I'd trust a Toyota VBIED to not blow up before I trust most American brands",
      "score": 3,
      "created_utc": 1740160802.0
    }
  ],
  "statistics": {
    "total_mentions": 3,
    "total_upvotes": 2,
    "post_mentions": 0,
    "comment_mentions": 3
  }
}