{
  "ticker": "UPS",
  "posts": [
    {
      "post_id": "1iv3i8r",
      "title": "Last play NVDA Yolo",
      "selftext": "Lost $10k today on 0dte NVDA calls. Had a chance to get out but missed my sell order by literally .01 and it cratered down. Averaged down all I had. Honestly not as bad as my other blow ups in the past where I lost 30k twice. But anyways, this is my last play. If I lose, I’ll take my scraps and just voo and recoup my losses in 25 years or so.",
      "score": 57,
      "upvote_ratio": 0.9,
      "created_utc": 1740176524.0,
      "mention_location": "selftext"
    }
  ],
  "comments": [
    {
      "comment_id": "me6dd9c",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "Bro…first and foremost, you gotta breathe and take a look in the mirror. Then you gotta be a big boy and heed what I’m about to say.\n\nTime to take some accountability.\n\n You have achieved peak regard using money you need to gamble on the stock market. It is genuinely the same as putting your mortgage money on the roulette table. I’m hoping that your wife knew what you were doing but I’m assuming that if she did she didn’t know the risk factor. Or she didn’t know what you were doing with joint money, which is worse.\n\nMy genuine advice is to open up. Let her know you fucked up, and take ownership. PLTR may recover but regardless of what it does or doesn’t do, you gotta be transparent with your wife. If she didn’t know you were doing this, you will have an infinitely more manageable position than if she finds out on her own. Idk your wife, and don’t know how she’ll react, but my wife always says (and lives out) that she would rather I be honest about my fuck ups than lying to her and hiding. \n\nI wish you well as you navigate this bro. You are in fight or flight. Use that ascended primate brain to get yourself centered and make a genuine plan. And tell your wife lol.\n\nGood luck!",
      "score": 304,
      "created_utc": 1740237925.0
    }
  ],
  "statistics": {
    "total_mentions": 2,
    "total_upvotes": 361,
    "post_mentions": 1,
    "comment_mentions": 1
  }
}