{
  "ticker": "HMC",
  "posts": [],
  "comments": [
    {
      "comment_id": "me2kfn5",
      "post_id": "1iuvlr8",
      "post_title": "Rivian $6.6B Loan from DOE Will Likely Be Cut",
      "comment_body": "Because i bought them a couple years ago. They havent shown it in those years. Im still holding hoping they pull their shit together. If and ehrn I need the remaining $$$ ill sell and take the loss. Its the game we play. But the reviews on their vehicles seem to be pretty damn good for the most part except for parts and maintenance. I also own Tesla stock.\n\nIn those years of owning stocks of 2 EV companies, customer demand has not been what the companies and market were thinking theyd be. Theres a reason\nFord\nGM\nHonda\nMB\nToyota\nVW\nVolvo\n\nHave scaled back production targets or POSTPONED building EV’s.",
      "score": -3,
      "created_utc": 1740177220.0
    },
    {
      "comment_id": "me0eadn",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "I love when people use recalls to bash Tesla. \n\nMeanwhile I’ve been waiting for a part for my Honda civic recall for 5 years now. 😂",
      "score": 31,
      "created_utc": 1740155024.0
    },
    {
      "comment_id": "me0opni",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "Honda just had a recall of 1.7 million cars due to a power steering work gear failure. \n\nCan’t fix that over the air either. \n\nI say Tesla in this case is miles ahead of other manufacturers specifically for this reason alone.",
      "score": 15,
      "created_utc": 1740157925.0
    },
    {
      "comment_id": "me0jbc7",
      "post_id": "1iuu75k",
      "post_title": "Tesla recalls 380,000 vehicles in US over power steering assist issue",
      "comment_body": "How is what I said a lie…? \n\nPeople constantly use Tesla recalls as a way to bash Tesla as if other car companies don’t have recalls. \n\nHonda just recently told me they finally have parts for my 2018 Honda a couple months ago. \n\nMy wife’s brand new CRV is only three months old and already has a recall on 720,000 cars due to the HPFP potentially leaking and catching fire.",
      "score": 12,
      "created_utc": 1740156427.0
    },
    {
      "comment_id": "mdza4nb",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "Happy this shit company didn't merge with Honda and fuck it up like some parasite",
      "score": 3,
      "created_utc": 1740142151.0
    },
    {
      "comment_id": "mdzkvpb",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "They just cancelled combining with Honda and Mitsubishi because Honda was insisting the Nissan would be a subsidiary of Honda!  Don’t see why they’d give up US plants when that’s where they make money.",
      "score": 1,
      "created_utc": 1740146122.0
    },
    {
      "comment_id": "me2rzuk",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "Weren’t they merging with Honda? Tf happened to that?",
      "score": 1,
      "created_utc": 1740179560.0
    },
    {
      "comment_id": "mdymc40",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "I think we're fucked, I don't understand how they screwed this up with Honda but they're seeking Tesla, who is running Nissan?",
      "score": 52,
      "created_utc": 1740129714.0
    },
    {
      "comment_id": "mdz0x3q",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "How did they screw it up with Honda? Nissan brings nothing to the table, they make junk.",
      "score": 20,
      "created_utc": 1740138017.0
    },
    {
      "comment_id": "mdz1mlp",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "That's why they should've been less of crybabys and get in deals with Honda, even if that means having less power, Nissan should've gone with them. Instead they went for the spoiled child behavior and threw that away.\n\nThat's what I mean by \"they screw it up with Honda\".",
      "score": 26,
      "created_utc": 1740138373.0
    },
    {
      "comment_id": "mdziii0",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "It's all about branding for each demographic.  Cheaper cars bring volume, and done correctly can be very profitable, great revenue, and are a hedge in an economic downturn.  Honda can keep the higher range models for mature adults.  Above them is Acura, and below them would be something like Nissan going after younger folks with little/no credit.  \n\n\nThis is nothing new.  It also alleviates the consumer \"growing out of\" your brand while still being able to capture them young.\n\n\nIt's not like Honda is in a hot bidding war to buy Nissan's secret sauce of every way not to make a CVT.  They're potentially buying a market segment, not technical prowess.",
      "score": 7,
      "created_utc": 1740145303.0
    },
    {
      "comment_id": "mdznb6g",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "Honda already has a great entry option in non-US markets, the Honda City, as well as the Honda HR-V (do they even sell that in the USA?). They could bring that over if cash is the problem. I own a City, I could've gotten a Civic or CR-V but why would I spend that much when I don't need it.",
      "score": 2,
      "created_utc": 1740146944.0
    },
    {
      "comment_id": "mdzrpzv",
      "post_id": "1iuk8th",
      "post_title": "Nissan surges on report Japan group may seek Tesla investment",
      "comment_body": "Yes, but they're Hondas.  Again, it's not the technical ability to make a car that has value.  Having distinct tiered brands with different markets to target does.  It's why McDonald's, despite owning a huge chunk of Chipotle, never branded themselves as McMexican or whatever, despite the product being very well liked.  It's why Luxottica could save SO MUCH by just branding everything Luxottica, or take a higher brand name like their Prada line and slap it on the cheaper brands, but they don't.  They don't hate savings.  They understand branding and demographics\n\n\nYoung kids rarely want to buy the same brand their parents do.  From an advertising side, an ad campaign aimed at getting middle aged folks to see Honda as a reliable value is going to hurt an ad campaign aimed at showing the Honda City as young, hip, yet unique.  \n\n\nThey do sell the HR-V in the US.",
      "score": 3,
      "created_utc": 1740148382.0
    }
  ],
  "statistics": {
    "total_mentions": 13,
    "total_upvotes": 170,
    "post_mentions": 0,
    "comment_mentions": 13
  }
}