{
  "ticker": "MSFT",
  "posts": [
    {
      "post_id": "1iuxgtn",
      "title": "Jensen Falldom For Next Week Earning",
      "selftext": "TLDR: I suck in trading, reverse me and buy Nvidia calls for free money.\n\nOkay okay, I have just got a -98% decrease in my XP puts, but hey I just asked my wife's boyfriend for a little bit more money and some Wendy's payout. Let's start how this NVIDIA will fall.\n\nCurrent situation:\n\n* Jensen's kingdom got kicked out of 140 club, and back to 139 (at the time I write this shit DD), P/E 55.14 (compared to 55.96 for Industrial average) and will have another earning call next week. \n* President Trump are planning to tax 25% tariff on chips outside of US, a bubble for Nvidia manufacturing\n* Yes yes I know 5000 series releases got sold out in seconds, but it was released on Jan 30, so it's next quarter so it doesn't do shit this quarter yet.\n\nWhy you should buy put?\n\n* Insider trading shows that there is a massive sell off, obviously it doesn't say anything much.\n\n[Insider Trading](https://preview.redd.it/t4w62gqc2jke1.png?width=1038&format=png&auto=webp&s=ad922a3c0eb97ce48039d912bb1cc677eeff5db9)\n\n* Nvidia tends to sensitive to news, especially world new and fluctuated the most when it comes to news.\n* Nvidia main manufacturing is TSMC, which got unlove for our beloved President Trump (https://www.mk.co.kr/en/business/11243062)\n* China (in general) wants to compete with chip manufacturing especially with Taiwan (https://www.taipeitimes.com/News/biz/archives/2025/02/11/2003831653)\n* Recently, Google and Microsoft starts to develop their own chips for their AI, so we are heading to era of independent chip-dependent from Nvidia\n* Sure sure, \"yOu sTill nEEd to bUy nVidIa Chips\".From previous earnings, there is a 17% increase in Data Center revenue Q4 2024, a 16% increase in Data Center revenue Q3 2024, and 23% increase in Data Center revenue Q2 2024, and 27% increase in Q1 2024. There is a slow down increase and with a nearest quantum chips release from IQVN, Google, Microsoft, I anticipate that this quarter can still have an increase but not impressive\n* So why I think Nvidia chips are stagnant? The investment of research from their previous earnings clearly shows that they don't want to heavily invest in research as much as before --> Chips independent era gonna be coming.\n\nWhy you should buy calls?\n\n* Because I buy puts\n\nPosition:\n\n[Position](https://preview.redd.it/5yp493fq8jke1.png?width=1372&format=png&auto=webp&s=042b36e8d27ba302fbd34fa70c73ee90ef1e3462)\n\nI buy on August because there are around 150k investment in the same investment and hey I am regarded.   \n  \nI eat crayon to make this dd so NFA but hey I'm gey bear.   \n  \n",
      "score": 0,
      "upvote_ratio": 0.42,
      "created_utc": 1740161428.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iu6kn4",
      "title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "selftext": "Ok i'll make it short, too much text and graph would make me looks smart wich would be misleading.\n\nMy DD is based on the simple fact that analyst estimates for Q4 are way too optimistic. You can see (despite beat) a decline/flatening of the EPS.\nCoupled with the rise of expectation (pic 2) it could lead to a miss and a similar situation than Feb 2024.\n\nWe also know for a fact that GOOG and MSFT missed expectations for their Cloud sector wich is the main revenue source from dropdox.\n\nPos : aroubd 50k in puts, see pic 4 and 5\n\n",
      "score": 511,
      "upvote_ratio": 0.96,
      "created_utc": 1740078685.0,
      "mention_location": "selftext"
    }
  ],
  "comments": [
    {
      "comment_id": "me4k4os",
      "post_id": "1iv7pic",
      "post_title": "Alibaba and the 23 thieves",
      "comment_body": "To have AAPL, TSLA, NVDA, MSFT and QQQ which already has all of these…\n\nYou definitely don’t know what you’re doing. You belong here.",
      "score": -1,
      "created_utc": 1740207725.0
    },
    {
      "comment_id": "me65w5u",
      "post_id": "1iv3i8r",
      "post_title": "Last play NVDA Yolo",
      "comment_body": "lol everyone feels this way right now. \n\nwhat will happen when everyone feels this way if they act on it? \n\nthis coming ER dip with be THE dip to buy, (what's more every one else is thinking this, I'll sell 140'ish and buy back the dip) Maybe this is why NVDA dropped 4%, instead of 2'ish) \n\nThat said, as much as people want out \"for good\"...it's because they feel no chances for these 165-195 12 month out price predictions anytime soon. \n\n  \n100% the ER dip rebound will hit the previous ath....and up and down up and down the stock will go.   \n  \nWhat sucks is head out my ass look at market, NVDA is NOT a highest MC company at this point...yes if Jensen's visions play out.  but as at now, even #2 mc is REALLY confident it will get there. \n\nSo NVDA will only poke it's head into highest MC, peeps sell it back down once it does. \n\n  \nhowever until concretely into NVDA is powering an \"industrial revolution\" it may touch highest MC but never stay there.  \n\nMarket so over valued, am comparing business model and prospects as compared to their respective market caps lol  \n\nAm sincerely surprised market values NVDA more than MSFT, but is obviously because of potentials, not anything realized. MSFT even already has their AI fuck up price in.",
      "score": 6,
      "created_utc": 1740235564.0
    },
    {
      "comment_id": "me4rjdh",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "😏 and then Microsoft late to the party on Quantum PR.",
      "score": 1,
      "created_utc": 1740211827.0
    },
    {
      "comment_id": "me2em4w",
      "post_id": "1iuy9jj",
      "post_title": "NVIDIA's CEO Jensen Huang Addresses The \"DeepSeek Fiasco\" For The First Time; Says Investors \"Overreacted\" & \"Got It All Wrong\"",
      "comment_body": "We'll need to see how many just decided to wait for earnings as exit liquidity. And Q1 and Q2 results will be the real test.\n\n[Microsoft CEO says there is an overbuild of AI infrastructure.](https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-ceo-says-there-is-an-overbuild-of-ai-systems-dismisses-agi-milestones-as-show-of-progress)",
      "score": -1,
      "created_utc": 1740175486.0
    },
    {
      "comment_id": "mdupqio",
      "post_id": "1iu6kn4",
      "post_title": "Dropbox $DBX is about to Drop (50k 0dte puts)",
      "comment_body": "# **TLDR**\n\n---\n\n**Ticker:** DBX\n\n**Direction:** Down\n\n**Prognosis:**  50k puts bought on DBX (Feb 21st expiry, various strikes shown in images).\n\n**Reasoning:** Analyst estimates for Q4 are too optimistic; EPS is declining/flat; GOOG and MSFT cloud sector misses (which impacts Dropbox's revenue).  OP anticipates a similar negative price reaction to the February 2024 earnings report.\n\n**OP's Risk Tolerance:** Appears to be high based on significant put position.\n\n**Disclaimer:** This is not financial advice.  OP states their analysis is simplistic and may be misleading.  Proceed with extreme caution.",
      "score": 1,
      "created_utc": 1740078691.0
    }
  ],
  "statistics": {
    "total_mentions": 7,
    "total_upvotes": 517,
    "post_mentions": 2,
    "comment_mentions": 5
  }
}