{
  "ticker": "AMZN",
  "posts": [
    {
      "post_id": "1iv0u3b",
      "title": "In Nancy and Bezo I trust",
      "selftext": "Bought AMZN and GOOGL leap last week, decided to double down today after the drop. I aint leaving until these turn 10 baggers.\n\nMy DD: trust in Nancy, and bezo because he refunded my lost gift card purchases.\n\nhttps://preview.redd.it/yqrxgwlzyjke1.png?width=872&format=png&auto=webp&s=6a392d8b612e994d01c4272fafc5d047bf86978c\n\nhttps://preview.redd.it/zt7e5vlzyjke1.png?width=856&format=png&auto=webp&s=a4cab9a225f9f3f6aefde32c9e7d35edc00690aa\n\n",
      "score": 133,
      "upvote_ratio": 0.86,
      "created_utc": 1740169810.0,
      "mention_location": "selftext"
    },
    {
      "post_id": "1iuxffd",
      "title": "Rivian (RIVN) Earnings Review - Bullish",
      "selftext": "TLDR: Rivian is a BUY, because it’s cheap  \n\nPost earnings call, Rivian has found gross profit, reducing vehicle production costs by $30k.  \n\nEyeing the R2 release in a year, they’ve sourced 95% of materials for it at half the cost of R1, seeing growing bargaining power in negotiations while realizing opportunities for production efficiencies.\n\nPeople are pumped about the R2 release.  \n\nWith $7B of cash they are guiding towards a <($2B) loss for 2025 -  \n\nleaving $5B of cash + $3.4B more from VW deal, putting them at a future $8.4B in cash alone for capex and expansion.  \n\nWhile the DOE loan might see pressure, they will also create **7500 US MANUFACTURING JOBS in Georgia**.  \n\nKilling manufacturing jobs isn’t really aligned with the current admin goals, even as they talk about ICE vehicles and the need to drill more.  \n\nGuidance for ‘25 was conservatively flat given the environment, however -  \n\nWith Tesla protests happening and a deep fleet of existing owners, the Tesla to Rivian trade-up is happening in force, which will especially add to R2 demand and existing R1 demand.  \n\nBetween R2 revenue at minimum $4.5B in ‘26, R1 sales, VW JV bringing in $2B in revenue (or more, as VW CEO has hinted at), potential further demand from other makers for Rivian tech,  \n\nAll of which doesn’t include EDV sales which just opened in February to other fleets, while they guide lower due to Amazon taking on slightly more orders in '24 and slightly less in '25, this is a unique differentiator that furthers the upside.\n\nRivian not only has a strong path to profitability, but likely future SPY inclusion as it reaches scale and profitability.  \n\nRivian is well capitalized, backed by big players who believe in their position, and most importantly -  \n\nPEOPLE LOVE THEIR PRODUCT.  \n\nIn the last year, Rivian is down 15%, while the company position and story becomes better and better.  \n\nLove the trade and upside here!\n\n(Positions: Long calls and shares)",
      "score": 33,
      "upvote_ratio": 0.87,
      "created_utc": 1740161331.0,
      "mention_location": "selftext"
    }
  ],
  "comments": [
    {
      "comment_id": "me6fe06",
      "post_id": "1ivkuuk",
      "post_title": "Am I cooked?",
      "comment_body": "Brother your expirations are long. \nPart of options is having the balls to watch trades in the red. \nThe alternative is knowing the exact entry point every time - which is near impossible. \nThe only one I’m concerned about it PLTR, I wouldn’t buy calls on such an over valued company. \n\nHole on tight and DCA your Google  and Amazon positions you will come out on top",
      "score": 39,
      "created_utc": 1740238541.0
    },
    {
      "comment_id": "me3fyrn",
      "post_id": "1iv7pic",
      "post_title": "Alibaba and the 23 thieves",
      "comment_body": "Amzn and googl is a good add at this level",
      "score": 11,
      "created_utc": 1740190565.0
    },
    {
      "comment_id": "me7bymw",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Imma triple down on my 5/16 amzn",
      "score": 1,
      "created_utc": 1740247941.0
    },
    {
      "comment_id": "me35k5u",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Guh, i don’t swing weeklies on amzn or googl. Nvda or tsla, or even meta, probably tho",
      "score": 4,
      "created_utc": 1740184044.0
    },
    {
      "comment_id": "me3ux57",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "Just admit you missed the boat lmao. We are at the tail end of the biggest bull market in history, and you think it’s going to go up even more because “low rates = stocks go up.” Every company from AMD and AMZN to XYZ and WMT is giving poor guidance because consumers don’t have any more spending money, and yet the dip is still being bought because regards have been conditioned to do so over the last couple years. Lowering rates and cutting government spending means stagflation — we will see how much the market likes that!",
      "score": 6,
      "created_utc": 1740196111.0
    },
    {
      "comment_id": "me48xai",
      "post_id": "1iv0u3b",
      "post_title": "In Nancy and Bezo I trust",
      "comment_body": "For shorter call on GOOGL, my TP is around 190-195 which hopefully googl can recover by next month. I will hold the leap until GOOGL goes to at least 220-230. AMZN TP is 240",
      "score": 2,
      "created_utc": 1740202054.0
    }
  ],
  "statistics": {
    "total_mentions": 8,
    "total_upvotes": 229,
    "post_mentions": 2,
    "comment_mentions": 6
  }
}